from time import sleep
import random
import re as res
import copy
import pickle

ver = lambda persent: persent<=random.randint(1,100)

def vv(v,x,ad,www,cr=False):
	print("\033[H\033[2J")
	tt,ttt,z=" ","",0
	while tt!=0:
		print(v)
		print("")
		for i in range(ad):
			if z%ad==i:
				tt="• "
				if cr:
					ttt=x[i].show({"🔶":0,"🥾":0,"⭐":0,"↩":0,"↪":0,"🚘":0,"🌈":0,"🫧":0,"💾":0,"🩸":0,"📗":0,"🧧":0,"<🟢>":0,"🔫":0,"⚡":0,"⏰":0,"🛑":0,"🔥":0,"🛡":0,"🅿":0,"🚀":0,"🦠":0,"":0,"♦":0,"⇫":0,"⊥":0,"🥇":0,"🧱":0,"🪨":0,"😇":0,"✈":0,"🕸":0,"▩":0,"🪑":0,"⌚":0,"Добор":0})
			print(tt+str(x[i])+ttt)
			tt,ttt=" ",""
		print("\n",www)
		aaa=input()
		if aaa=="":
			z+=1
		else:
			print("\033[H\033[2J")
			tt=0
			return x[z%ad]
		print("\033[H\033[2J")

def Dizzy(text):
	return "\033[1m\033[36m{}\033[0m".format(text)

def Riggs(text):
	return "\033[1m\033[33m{}\033[0m".format(text)

def Peri(text):
	return "\033[1m\033[35m{}\033[0m".format(text)

def Isaak(text):
	return "\033[1m\033[32m{}\033[0m".format(text)

def Dreik(text):
	return "\033[1m\033[31m{}\033[0m".format(text)

def Max(text):
	return "\033[1m\033[34m{}\033[0m".format(text)

def Academia(text):
	return "\033[1m\033[30m{}\033[0m".format(text)

def Kisa(text):
	return "\033[1m\033[38m{}\033[0m".format(text)

def d(x):
	for i in range(0,len(x),2):
		print("\033[H\033[2J")
		if x[i]=="Диззи":
			input(x[i]+":  "+Dizzy(x[i+1]))
		elif x[i]=="Риггс":
			input(x[i]+":  "+Riggs(x[i+1]))
		elif x[i]=="Пери":
			input(x[i]+":  "+Peri(x[i+1]))
		elif x[i]=="Айзек":
			input(x[i]+":  "+Isaak(x[i+1]))
		elif x[i]=="Дрейк":
			input(x[i]+":  "+Dreik(x[i+1]))
		elif x[i]=="Макс":
			input(x[i]+":  "+Max(x[i+1]))
		elif x[i]=="Академия":
			input(x[i]+":  "+Academia(x[i+1]))
		elif x[i]=="Киса":
			input(x[i]+":  "+Kisa(x[i+1]))
		else:
			input(x[i]+":  "+x[i+1])

def blue(text):
	blue_pattern = r'\033\[34m.*?\033\[0m'
	return bool(res.search(blue_pattern, text))

def red(text):
	red_pattern = r'\033\[31m.*?\033\[0m'
	return bool(res.search(red_pattern, text))

def yellow(text):
	yellow_pattern = r'\033\[33m.*?\033\[0m'
	return bool(res.search(yellow_pattern, text))

def recolor(text):
	return res.sub(r'\033\[[0-9;]*m', '', text)


def otovr(vs,sdwig):
	vrag1=[" "]*55+["\n"]
	vrag2=[" "]*55+["\n"]
	vrag3=[" "]*55+["\n"]
	for i in range(len(vs["1"])):
		if i in vs["Броня"]:
			vrag3[sdwig+i]="\033[1m\033[34m{}\033[0m".format(vs["3"][i])
		elif i in vs["Уязвимость"]:
			vrag3[sdwig+i]="\033[1m\033[33m{}\033[0m".format(vs["3"][i])
		elif i in vs["Трещина"]:
			vrag3[sdwig+i]="\033[1m\033[31m{}\033[0m".format(vs["3"][i])
		else:
			vrag3[sdwig+i]=vs["3"][i]
		vrag2[sdwig+i]=vs["2"][i]
		vrag1[sdwig+i]=vs["1"][i]
	return vrag1,vrag2,vrag3

def vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,uron,defe,life,var,mhp,mbron,re,пр):
	попал=False
	vdefe+=ef["🛡"]
	uvrag=[" "]*55+["\n"]
	for j in sship["Пушка"]:
		if enef["↩"]>0:
			while j+_sdwig-sdwig in vs["Твёрд"]:
				sdwig-=1
				midl.insert(-2,midl.pop(0))
			enef["↩"]-=1
		if enef["↪"]>0:
			while j+_sdwig-sdwig in vs["Твёрд"]:
				sdwig+=1
				midl.insert(0,midl.pop(-2))
			enef["↪"]-=1
		vrag1=[" "]*55+["\n"]
		vrag2=[" "]*55+["\n"]
		vrag3=[" "]*55+["\n"]
		for i in range(len(vs["1"])):
			if i in vs["Броня"]:
				vrag3[sdwig+i]="\033[1m\033[34m{}\033[0m".format(vs["3"][i])
			elif i in vs["Уязвимость"]:
				vrag3[sdwig+i]="\033[1m\033[33m{}\033[0m".format(vs["3"][i])
			elif i in vs["Трещина"]:
				vrag3[sdwig+i]="\033[1m\033[31m{}\033[0m".format(vs["3"][i])
			else:
				vrag3[sdwig+i]=vs["3"][i]
			vrag2[sdwig+i]=vs["2"][i]
			vrag1[sdwig+i]=vs["1"][i]
		kord=j+_sdwig
		uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
		if midl[kord]==" ":
			midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
			uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
			if vrag3[kord]==" ":
				попал=False
				if "🔗 Цепляющийся лазер" in re and (vrag3[kord+1]!=" " or vrag3[kord-1]!=" "):
					vbron-=1
					if vbron<0:
						bron+=vbron
						vbron=0
						if bron<0 and enef["🥇"]==0:
							hp+=bron
							bron=0
				vrag1[kord]="\033[1m\033[31m{}\033[0m".format("|")
				vrag2[kord]="\033[1m\033[31m{}\033[0m".format("|")
				vrag3[kord]="\033[1m\033[31m{}\033[0m".format("|")
			else:
				ii=j+_sdwig-sdwig
				if пр:
					if ii in vs["Уязвимость"]:
						hp-=uron+ef["🔶"]+ef["♦"]+1
					elif ii in vs["Трещина"]:
						hp-=2*(uron+ef["🔶"]+ef["♦"])
					else:
						hp-=uron+ef["🔶"]+ef["♦"]
				else:
					if ii in vs["Броня"]:
						vbron-=uron+ef["🔶"]+ef["♦"]-1
					elif ii in vs["Уязвимость"]:
						vbron-=uron+ef["🔶"]+ef["♦"]+1
					elif ii in vs["Трещина"]:
						vbron-=2*(uron+ef["🔶"]+ef["♦"])
					else:
						vbron-=uron+ef["🔶"]+ef["♦"]
				if enef["🧱"]>0:
					if ii in vs["Трещина"]:
						vs["Трещина"].remove(ii)
					if not(ii in vs["Броня"]):
						vs["Броня"].append(ii)
				попал=True
				if ef["🕸"]>0:
					for key,v in var.items():
						if key=="ЭфУрон" and len(vs["Пушка"])>0:
							for _ in range(0,len(var[key]),4):
								if ii==vs["Пушка"][var["ЭфУрон"][_+1]]:
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Дебаф":
							for _ in range(0,len(var[key]),2):
								if ii==var["Дебаф"][_+1]:
									var["Дебаф"].pop(_)
									var["Дебаф"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Разд":
							for _ in range(0,len(var[key]),2):
								if ii==var["Разд"][_+1]:
									var["Разд"].pop(_)
									var["Разд"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Выпуск":
							for _ in range(0,len(var[key]),2):
								if ii==var["Выпуск"][_+1]:
									var["Выпуск"].pop(_)
									var["Выпуск"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Вщит":
							for _ in range(0,len(var[key]),2):
								if ii==var["Вщит"][_+1]:
									var["Вщит"].pop(_)
									var["Вщит"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Урон" and var["Урон"]!=[0,0]:
							for _ in range(0,len(var[key]),2):
								if ii==vs["Пушка"][var["Урон"][_+1]]:
									var["Урон"].pop(_)
									var["Урон"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Усиление":
							for _ in range(0,len(var[key]),2):
								if ii==var["Усиление"][_+1]:
									var["Усиление"].pop(_)
									var["Усиление"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Щит":
							for _ in range(0,len(var[key]),2):
								if ii==var["Щит"][_+1]:
									var["Щит"].pop(_)
									var["Щит"].pop(_)
									var["Ото"][ii]=" "
									break
				if vbron<0:
					bron+=vbron
					vbron=0
					if bron<0 and enef["🥇"]==0:
						hp+=bron
						bron=0
		else:
			if blue(midl[kord]):
				midl[kord]=recolor(midl[kord])
			else:
				if "🏓 Ракетка" in re:
					midl[kord]=midl[kord].replace("ᐁ","∆",1)
					midl[kord]=midl[kord].replace("▼","▲",1)
					midl[kord]=midl[kord].replace("⟰","⟱",1)
					midl[kord]=midl[kord].replace("⸔","⸕",1)
					midl[kord]=midl[kord].replace("⇘","⇖",1)
					midl[kord]=midl[kord].replace("⬆","⬇",1)
					midl[kord]=midl[kord].replace("⤈","⤉",1)
				else:
					if "⦻" in midl[kord]:
						vdefe-=2
						if vdefe<0:
							defe+=vdefe
							vdefe=0
							if defe<0 and ef["🥇"]==0:
								life+=defe
								defe=0
					if "⊕" in midl[kord]:
						life+=2
						if "🩹 Усилитель лечения" in re:
							life+=1
					if "☄" in midl[kord]: 											ef["💎"]+=1
					midl[kord]="💥"
		print("\033[H\033[2J")
		vrag=vs["Имя"]+"\n"+"\033[1m\033[31m{}\033[0m".format("["+hp*"■"+(mhp-hp)*" "+"]           ")+"\033[1m\033[34m{}\033[0m".format("["+bron*"■"+(mbron-bron)*" "+"]    ")
		if vbron>0:
			vrag+="\033[1m\033[35m{}\033[0m".format("["+vdefe*"■"+"]  ")
		for key,v1 in enef.items():
			if v1>0:
				vrag+=" "+str(v1)+key
		vrag+="\n"
		print(vrag)
		print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
		print(ship,"\n")
		sleep(0.2)
		uship[kord]=" "
		if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
			midl[kord]=" "
		if uvrag[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
				uvrag[kord]=" "
		if vrag3[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
			vrag3[kord]=" "
			vrag2[kord]=" "
			vrag1[kord]=" "
		if попал==False and "💢 Рекалибратор" in re:
			ef["Добор"]+=1
		if попал:
			if enef["⊥"]+enef["⇫"]>0:
				if ef["↩"]>0:
					ef["↩"]-=1
					while ship1[vs["Пушка"][0]+sdwig]!=" ":
						sdwig+=1
						midl.insert(0,midl.pop(-2))
				if ef["↪"]>0:
					ef["↪"]-=1
					while ship1[vs["Пушка"][0]+sdwig]!=" ":
						sdwig-=1
						midl.insert(-2,midl.pop(0))
				vrag1,vrag2,vrag3=otovr(vs,sdwig)
				kord=vs["Пушка"][0]+sdwig
				uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
				if midl[kord]==" ":
					midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
					uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
					if ship1[kord]==" ":
						ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
						ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
						ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
					else:
						ii=kord-_sdwig
						if ii in sship["Броня"]:
							vdefe-=enef["⇫"]+enef["⊥"]-1
						elif ii in sship["Уязвимость"]:
							vdefe-=enef["⇫"]+enef["⊥"]+1
						elif ii in sship["Трещина"]:
							vdefe-=2*(enef["⇫"]+enef["⊥"])
						else:
							vdefe-=enef["⇫"]+enef["⊥"]
						if vdefe<0:
							defe+=vdefe
							vdefe=0
							if defe<0 and ef["🥇"]==0:
								life+=defe
								defe=0
				else:
					if blue(midl[kord]):
						midl[kord]=recolor(midl[kord])
					else:
							if "⦻" in midl[kord]:
								vbron-=2
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							if "⊕" in midl[kord]:
								hp+=2
							if "☄" in midl[kord]:
								ef["💎"]+=1
							midl[kord]="💥"
				print("\033[H\033[2J")
				print(vrag)
				print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
				print(ship,"\n")
				sleep(0.2)
				uvrag[kord]=" "
				if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					midl[kord]=" "
				if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					uship[kord]=" "
				if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					ship3[kord]=" "
					ship2[kord]=" "
					ship1[kord]=" "

	for i in range(len(midl)):
		if "⍓" in midl[i]:
			uvrag[i]="\033[1m\033[31m{}\033[0m".format("|")
			if vrag3[i]==" ":
				попал=False
				vrag1[i]="\033[1m\033[31m{}\033[0m".format("|")
				vrag2[i]="\033[1m\033[31m{}\033[0m".format("|")
				vrag3[i]="\033[1m\033[31m{}\033[0m".format("|")
			else:
				ii=i-sdwig
				if ii in vs["Броня"]:
					vbron-=uron+ef["🔶"]+ef["♦"]-1
				elif ii in vs["Уязвимость"]:
					vbron-=uron+ef["🔶"]+ef["♦"]+1
				elif ii in vs["Трещина"]:
					vbron-=2*(uron+ef["🔶"]+ef["♦"])
				else:
					vbron-=uron+ef["🔶"]+ef["♦"]
				попал=True
				if enef["🧱"]>0:
					if ii in vs["Трещина"]:
						vs["Трещина"].remove(ii)
					if not(ii in vs["Броня"]):
						vs["Броня"].append(ii)
				if ef["🕸"]>0:
					for key,v in var.items():
						if key=="ЭфУрон":
							for _ in range(0,len(var[key]),4):
								if ii==vs["Пушка"][var["ЭфУрон"][_+1]]:
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["ЭфУрон"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Дебаф":
							for _ in range(0,len(var[key]),2):
								if ii==var["Дебаф"][_+1]:
									var["Дебаф"].pop(_)
									var["Дебаф"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Разд":
							for _ in range(0,len(var[key]),2):
								if ii==var["Разд"][_+1]:
									var["Разд"].pop(_)
									var["Разд"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Выпуск":
							for _ in range(0,len(var[key]),2):
								if ii==var["Выпуск"][_+1]:
									var["Выпуск"].pop(_)
									var["Выпуск"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Вщит":
							for _ in range(0,len(var[key]),2):
								if ii==var["Вщит"][_+1]:
									var["Вщит"].pop(_)
									var["Вщит"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Урон":
							for _ in range(0,len(var[key]),2):
								if ii==vs["Пушка"][var["Урон"][_+1]]:
									var["Урон"].pop(_)
									var["Урон"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Усильнение":
							for _ in range(0,len(var[key]),2):
								if ii==var["Усиление"][_+1]:
									var["Усиление"].pop(_)
									var["Усиление"].pop(_)
									var["Ото"][ii]=" "
									break
						if key=="Щит":
							for _ in range(0,len(var[key]),2):
								if ii==var["Щит"][_+1]:
									var["Щит"].pop(_)
									var["Щит"].pop(_)
									var["Ото"][ii]=" "
									break
				if vbron<0:
					bron+=vbron
					vbron=0
					if bron<0 and enef["🥇"]==0:
						hp+=bron
						bron=0
			print("\033[H\033[2J")
			print(vrag)
			print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
			print(ship,"\n")
			sleep(0.2)
			uship[i]=" "
			if uvrag[i]=="\033[1m\033[31m{}\033[0m".format("|"):
				uvrag[i]=" "
			if vrag3[i]=="\033[1m\033[31m{}\033[0m".format("|"):
				vrag3[i]=" "
				vrag2[i]=" "
				vrag1[i]=" "
			if enef["⊥"]+enef["⇫"]>0 and попал:
				if ef["↩"]>0:
					ef["↩"]-=1
					while ship1[vs["Пушка"][0]+sdwig]!=" ":
						sdwig+=1
						midl.insert(0,midl.pop(-2))
				if ef["↪"]>0:
					ef["↪"]-=1
					while ship1[vs["Пушка"][0]+sdwig]!=" ":
						sdwig-=1
						midl.insert(-2,midl.pop(0))
				vrag1,vrag2,vrag3=otovr(vs,sdwig)
				kord=vs["Пушка"][0]+sdwig
				uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
				if midl[kord]==" ":
					midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
					uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
					if ship1[kord]==" ":
						ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
						ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
						ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
					else:
						ii=kord-_sdwig
						if ii in sship["Броня"]:
							vdefe-=enef["⇫"]+enef["⊥"]-1
						elif ii in sship["Уязвимость"]:
							vdefe-=enef["⇫"]+enef["⊥"]+1
						elif ii in sship["Трещина"]:
							vdefe-=2*(enef["⇫"]+enef["⊥"])
						else:
							vdefe-=enef["⇫"]+enef["⊥"]
						if vdefe<0:
							defe+=vdefe
							vdefe=0
							if defe<0 and ef["🥇"]==0:
								life+=defe
								defe=0
				else:
					if blue(midl[kord]):
						midl[kord]=recolor(midl[kord])
					else:
						if "⦻" in midl[kord]:
							vbron-=2
							if vbron<0:
								bron+=vbron
								vbron=0
								if bron<0 and enef["🥇"]==0:
									hp+=bron
									bron=0
						if "⊕" in midl[kord]:
							hp+=2
						if "☄" in midl[kord]: 											ef["💎"]+=1
						midl[kord]="💥"
				print("\033[H\033[2J")
				print(vrag)
				print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
				print(ship,"\n")
				sleep(0.2)
				uvrag[kord]=" "
				if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					midl[kord]=" "
				if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					uship[kord]=" "
				if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
					ship3[kord]=" "
					ship2[kord]=" "
					ship1[kord]=" "
	if ef["🕸"]>0:
		ef["🕸"]-=1
	return vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var

def ee(**k):
	f={"Урон":[0,0],"Усиление":["",0],"Движ":-666,"Ото":[""],"Щит":[0,0],"Вщит":[0,0],"Выпуск":[" ",0],"Разд":[0,0],"Дебаф":["",0],"ЭфУрон":[0,0,"",0]}
	for key,v in k.items():
		f[key]=v
	return f

#Враги
def ene(name,h=0,ef={"🔶":0},midl=[],sdwig=0,sship=[]):
	if name=="Беспилотник Цикада":
		if h>0:
			if h%2==1:
				return ee(Урон=[2+ef["🔶"],0],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "," "])
			if h%2==0:
				return ee(Усиление=["🔶",1],Щит=[2,3],Движ=0,Ото=[" ","\033[1m\033[32m{}\033[0m".format("#")," ","\033[1m\033[34m{}\033[0m".format("⛨")," "])
		return {"Имя":"Беспилотник Цикада","Кабина":[1],"Отсек":[3],"Пушка":[2],"Остальное":[0,4],"Твёрд":[0,1,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ◢#◣ ","2":"◢###◣","3":"\◡∥~/","Корпус":8,"Щит":4}
	elif name=="Разведдрон Комар":
		if h>0:
			if h%3==2 or h%3==0:
				return ee(Урон=[2+ef["🔶"],0],Усиление=["↩",1],Ото=["\033[1m\033[32m{}\033[0m".format("#"),"\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "])
			if h%3==1:
				return ee(Урон=[4-abs((h-1)//3)+ef["🔶"],0],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(4-abs((h-1)//3)+ef["🔶"]))," "])
		return {"Имя":name,"Кабина":[],"Отсек":[],"Пушка":[1],"Остальное":[0,2],"Твёрд":[0,1,2],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"◥ ◤","2":"#∆#","3":"▐∥▌","Корпус":5,"Щит":3}
	elif name=="Хаб дронов Монарх":
		if h>0:
			if h%2==1:
				return ee(Выпуск=["▼",1],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format("!")," "])
			if h%2==0:
				return ee(Выпуск=["⟰",0,"ᐁ",1],Ото=["\033[1m\033[31m{}\033[0m".format("!")," ","\033[1m\033[31m{}\033[0m".format("!")," "])
		return {"Имя":name,"Кабина":[1],"Отсек":[0,2],"Пушка":[],"Остальное":[3],"Твёрд":[0,1,2,3],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ^^ ","2":"####","3":"~◡~◤","Корпус":4,"Щит":8}
	elif name=="Сапёр":
		if h>0:
			if h==1:
				return ee(Движ=0,Выпуск=["⇅",0,"⇅",1],Урон=[2+ef["🔶"],0],Ото=["\033[1m\033[31m{}\033[0m".format("!")," "," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "," ","\033[1m\033[31m{}\033[0m".format("!")])
			elif (midl[sdwig]==" " and midl[sdwig+6]==" ") or ((midl[sdwig]==" " or midl[sdwig+6]==" ") and midl.count("⇅")<=5):
				return ee(Движ=0,Выпуск=["⇅",0,"⇅",1],Урон=[1+ef["🔶"],0],Ото=["\033[1m\033[31m{}\033[0m".format("!")," "," ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," "," ","\033[1m\033[31m{}\033[0m".format("!")])
			else:
				return ee(Урон=[2+ef["🔶"],0],Усиление=["⇫",1],Ото=[" "," "," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[32m{}\033[0m".format("#")," "," "])
		return {"Имя":name,"Кабина":[2,4],"Отсек":[0,6],"Пушка":[3],"Остальное":[],"Твёрд":[0,2,3,4,6],"Броня":[],"Уязвимость":[2,4],"Трещина":[],"1":"^ ◣_◢ ^","2":"#-###-#","3":"~ ◡∥◡ ~","Корпус":8,"Щит":8}
	elif name=="Перехватчик Куколка":
		if h>0:
			if h%2==1:
				return ee(Урон=[2+ef["🔶"],0,2+ef["🔶"],1],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "])
			if h%2==0:
				return ee(Разд=[card(имя="Мусор",доп="▟"),2,card(имя="Мусор",доп="▟"),3,card(имя="Мусор",доп="▟"),4],Щит=[1,1],Ото=[" ","\033[1m\033[34m{}\033[0m".format("⛨"),"\033[1m\033[33m{}\033[0m".format("🂠"),"\033[1m\033[33m{}\033[0m".format("🂠"),"\033[1m\033[33m{}\033[0m".format("🂠")," "])
		return {"Имя":name,"Кабина":[],"Отсек":[1,4],"Пушка":[2,3],"Остальное":[],"Твёрд":[0,1,2,3,4,5],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" _◢◣_ ","2":"◢####◣","3":"◥~∥∥~◤","Корпус":11,"Щит":4}
	elif name=="Истребитель Олень":
		if h>0:
			if h%2==1:
				return ee(Урон=[1+ef["🔶"],0,3+ef["🔶"],1,1+ef["🔶"],2],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," ","\033[1m\033[31m{}\033[0m".format(str(3+ef["🔶"]))," ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," "])
			if h%2==0:
				return ee(Движ=0,Урон=[2+ef["🔶"],1],Щит=[2,2],Ото=[" "," ","\033[1m\033[34m{}\033[0m".format("⛨"),"\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "," "," "])
		return {"Имя":name,"Кабина":[],"Отсек":[2,4],"Пушка":[1,3,5],"Остальное":[0,6],"Твёрд":[0,1,2,3,4,5,6],"Броня":[],"Уязвимость":[2,4],"Трещина":[],"1":"  ◢^◣  ","2":" ◢###◣ ","3":"◥∥~∥~∥◤","Корпус":16,"Щит":5}
	elif name=="Башня":
		if h>0:
			if h%2==1:
				return ee(Урон=[2+ef["🔶"],0],Ото=[" "," "," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "])
			if h%2==0:
				return ee(Разд=[card(имя="🔥 Миазма",статус={"🔥":1},доп="▟"),2,card(имя="🩸 Токсик",доп="-1🩸 ▟"),4],Дебаф=["🩸",1],Ото=["\033[1m\033[33m{}\033[0m".format("◊")," ","\033[1m\033[33m{}\033[0m".format("🂠")," ","\033[1m\033[33m{}\033[0m".format("🂠")])
		return {"Имя":name,"Кабина":[0],"Отсек":[],"Пушка":[3],"Остальное":[2,4],"Твёрд":[0,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"⚐  ♖ ","2":"# ###","3":"◡ ◥∥◤","Корпус":10,"Щит":5}
	elif name=="Дрон Жало":
		if h>0:
			return ee(Урон=[2+ef["🔶"],0],Выпуск=["⤈",0],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!")," "," "])
		return {"Имя":name,"Кабина":[3],"Отсек":[2],"Пушка":[1],"Остальное":[0,4],"Твёрд":[0,1,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ^^^ ","2":"◥###◤","3":"◥∥~◡◤","Корпус":10,"Щит":0}
	elif name=="Болид Огненный шар":
		if h>0:
			if h%3==1:
				return ee(ЭфУрон=[3+ef["🔶"],0,"🔥",1,1+ef["🔶"],2,"🔥",1],Ото=["\033[1m\033[33m{}\033[0m".format(str(3+ef["🔶"]))," "," ","\033[1m\033[33m{}\033[0m".format(str(1+ef["🔶"]))])
			if h%3==2:
				return ee(ЭфУрон=[4+ef["🔶"],1,"🔥",1],Щит=[1,1],Движ=0,Ото=[" ","\033[1m\033[34m{}\033[0m".format("⛨"),"\033[1m\033[33m{}\033[0m".format(str(4+ef["🔶"]))," "])
			if h%3==0:
				return ee(ЭфУрон=[2+ef["🔶"],0,"🔥",1,1+ef["🔶"],1,"🔥",1,2+ef["🔶"],2,"🔥",1],Ото=["\033[1m\033[33m{}\033[0m".format(str(2+ef["🔶"]))," ","\033[1m\033[33m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[33m{}\033[0m".format(str(2+ef["🔶"]))])
		return {"Имя":name,"Кабина":[1],"Отсек":[],"Пушка":[0,2,3],"Остальное":[],"Твёрд":[0,1,2,3],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ◢◣ ","2":"◢##◣","3":"∥◡▽∥","Корпус":10,"Щит":4}
	elif name=="Сама скромность":
		if h>0:
			if h%3==1:
				return ee(Урон=[2+ef["🔶"],0,1+ef["🔶"],1,1+ef["🔶"],4,2+ef["🔶"],5],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," "," "," ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "])
			if h%3==2:
				return ee(Урон=[1+ef["🔶"],1,1+ef["🔶"],2,1+ef["🔶"],3,1+ef["🔶"],4],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," ","\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"]))," "," "])
			if h%3==0:
				return ee(Урон=[1+ef["🔶"],2,1+ef["🔶"],2,1+ef["🔶"],2,1+ef["🔶"],3,1+ef["🔶"],3,1+ef["🔶"],3],Ото=[" "," "," ","\033[1m\033[31m{}\033[0m".format(str((1+ef["🔶"])*3))," ","\033[1m\033[31m{}\033[0m".format(str((1+ef["🔶"])*3))," "," "," "])
		return {"Имя":name,"Кабина":[4],"Отсек":[],"Пушка":[1,2,3,5,6,7],"Остальное":[0,8],"Твёрд":[0,1,2,3,4,5,6,7,8],"Броня":[],"Уязвимость":[],"Трещина":[4],"1":" _◢^_^◣_ ","2":"◢#######◣","3":"◥∥▽∥◡∥▽∥◤","Корпус":20,"Щит":0}
	elif name=="Нидлер":
		if h>0:
			if h%2==1:
				return ee(Движ=random.choice([-2,-3,-4,4,3,2]),Усиление=["⇫",2],Вщит=[2,1],Ото=[" ","\033[1m\033[35m{}\033[0m".format("⛨")," ","\033[1m\033[32m{}\033[0m".format("#")," "," "," "])
			if h%2==0:
				return ee(Урон=[2+ef["🔶"],0],Разд=[card(имя="Обход защиты",доп="При вытаскивании наносит 1 урона",цена=20),3],Ото=[" "," ","\033[1m\033[33m{}\033[0m".format("🂠")," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))," "])
		return {"Имя":name,"Кабина":[3],"Отсек":[],"Пушка":[4],"Остальное":[0,5],"Твёрд":[0,1,2,3,4,5],"Броня":[],"Уязвимость":[1,2],"Трещина":[],"1":"◢/∆∆\\◣","2":"◢####◣","3":"◥~~◡∥◤","Корпус":6,"Щит":16}
	elif name=="Кристальное создание":
		if h>0:
			ото=12*[" "]
			урон=[]
			for i in range(12):
				урон.extend([0,i])
			hh=2+h
			while hh>0:
				i=random.randint(0,11)
				k=random.randint(1,3)
				урон[2*i]+=k
				hh-=k
			for i in range(len(ото)):
				if урон[2*i]>0:
					ото[i]="\033[1m\033[31m{}\033[0m".format(урон[2*i])
			i=0
			while i<len(урон):
				if урон[i]==0:
					урон.pop(i)
					урон.pop(i)
					i=0
				else:
					i+=2
			движ=-666
			k=0
			for i in range(28-(len(sship["1"])-1)//2,28-(len(sship["1"])-1)//2+len(sship["1"])):
				if i in range(sdwig,sdwig+12):
					k+=1
				if k>=3:
					движ=0
			return ee(Урон=урон,Ото=ото,Движ=движ)
		return {"Имя":name,"Кабина":[],"Отсек":[],"Пушка":[0,1,2,3,4,5,6,7,8,9,10,11],"Остальное":[],"Твёрд":[0,1,2,3,4,5,6,7,8,9,10,11],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ◿Λ ⃤Λ ⃤Λ◺  ","2":"◿"+"#"*10+"◺","3":"V"*12,"Корпус":30,"Щит":0}
	elif name=="Беспилотник Цикада МК2":
		if h>0:
			if h%2==1:
				return ee(Урон=[4+ef["🔶"],1],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format(str(4+ef["🔶"]))," "," "])
			if h%2==0:
				return ee(Урон=[4+ef["🔶"],1],Усиление=["🔶",1],Ото=[" "," ","\033[1m\033[31m{}\033[0m".format(str(4+ef["🔶"])),"\033[1m\033[32m{}\033[0m".format("#")," "])
		return {"Имя":name,"Кабина":[1],"Отсек":[3],"Пушка":[0,2,4],"Остальное":[],"Твёрд":[0,1,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ◢#◣ ","2":"◢/#\◣","3":"∥◡∥~∥","Корпус":10,"Щит":5}
	elif name=="Защитник Голиаф":
		if h>0:
			if h%2==1:
				return ee(Урон=[2+ef["🔶"],0,2+ef["🔶"],1],Усиление=["🧱",3],Выпуск=["⦻",0],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"])),"\033[1m\033[32m{}\033[0m".format("#")," "])
			if h%2==0:
				return ee(Урон=[1+ef["🔶"],0,1+ef["🔶"],1]*h//2,Вщит=[2,4],Ото=[" ","\033[1m\033[31m{}\033[0m".format(str((1+ef["🔶"])*h//2))," ","\033[1m\033[31m{}\033[0m".format(str((1+ef["🔶"])*h//2)),"\033[1m\033[35m{}\033[0m".format("⛨")," "])
		return {"Имя":name,"Кабина":[2],"Отсек":[4],"Пушка":[1,3],"Остальное":[0,5],"Твёрд":[0,1,2,3,4,5],"Броня":[],"Уязвимость":[],"Трещина":[2,4],"1":" ◥^^◤ ","2":"◢|##|◣","3":"◥∥◡∥~◤","Корпус":15,"Щит":6}
	elif name=="Ракетчик РК-33":
		if h>0:
			if h==1:
				return ee(Урон=[1+ef["🔶"],0],Выпуск=["⬇",0,"⬇",0,"⬇",0],Ото=["\033[1m\033[31m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!")," "," "])
			elif h<3:
				return ee(Выпуск=["⬇",0,"⬇",1,"⬇",2],Ото=[" ","\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!")," "," "])
			else:
				return ee(Выпуск=["⬇",0,"⤈",1,"⬇",2],Ото=[" ","\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format("!"), " ", " "])
		return {"Имя":name,"Кабина":[4],"Отсек":[1,2,3],"Пушка":[0,5],"Остальное":[],"Твёрд":[0,1,2,3,4,5],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"∆|∆|∆ ","2":"◥####◤","3":"∥~~~◡∥","Корпус":20,"Щит":0}
	elif name=="ДЛХ Громила":
		if h>0:
			if h%3==1:
				return ee(Урон=[2+ef["🔶"],1],ЭфУрон=[1+ef["🔶"],0,"🛑",1],Выпуск=["⬇",0],Ото=["\033[1m\033[33m{}\033[0m".format(str(1+ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!")," ","\033[1m\033[31m{}\033[0m".format(str(2+ef["🔶"]))])
			elif h % 3 == 2:
				return ee(Урон=[1 + ef["🔶"], 0], ЭфУрон=[3 + ef["🔶"], 1, "🛑", 1], Выпуск=["⤈", 0],Ото=["\033[1m\033[31m{}\033[0m".format(str(1 + ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!"), " ","\033[1m\033[33m{}\033[0m".format(str(3 + ef["🔶"]))])
			elif h % 3 == 0:
				return ee(ЭфУрон=[2 + ef["🔶"], 1, "🛑", 1, 2 + ef["🔶"], 1, "🛑", 1], Выпуск=["⇘", 0],Ото=[" ","\033[1m\033[31m{}\033[0m".format("!"), " ","\033[1m\033[33m{}\033[0m".format(str((2 + ef["🔶"])*2))])
		return {"Имя":name,"Кабина":[2],"Отсек":[1],"Пушка":[0,3],"Остальное":[],"Твёрд":[0,1,2,3],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"∆  ∆","2":"◥#_◤","3":"∥~◡∥","Корпус":14,"Щит":6}
	elif name=="Шипозад":
		if 0 < h < 3:
			return ee(Выпуск=["⬇", 0],ЭфУрон=[1+ef["🔶"],0,"⏰",1,1+ef["🔶"],1,"⏰",1],Ото=["\033[1m\033[33m{}\033[0m".format(str(1 + ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!"), " ", " ", " ","\033[1m\033[33m{}\033[0m".format(str(1 + ef["🔶"]))])
		elif h >= 3:
			return ee(Выпуск=["⇘", 0], ЭфУрон=[1 + ef["🔶"], 0, "⏰", 1, 1 + ef["🔶"], 1, "⏰", 1],
					  Ото=["\033[1m\033[33m{}\033[0m".format(str(1 + ef["🔶"])), "\033[1m\033[31m{}\033[0m".format("!")," ", " ", " ", "\033[1m\033[33m{}\033[0m".format(str(1 + ef["🔶"]))])
		return {"Имя":name,"Кабина":[3],"Отсек":[1],"Пушка":[0,5],"Остальное":[],"Твёрд":[0,1,3,5],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"◜◝    ","2":"## # #","3":"∥~ ◡ ∥","Корпус":14,"Щит":6}
	elif name=="Канонир":
		if h % 3 == 1:
			return ee(Выпуск=["⬇", 0,"⬇", 5],Урон=[2+ef["🔶"],1,2+ef["🔶"],4],Ото=["\033[1m\033[31m{}\033[0m".format("!"),"\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"])), " ", " ", " ", "\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"])), "\033[1m\033[31m{}\033[0m".format("!")])
		elif h % 3 == 2:
			return ee(Выпуск=["⬇", 1, "⬇", 4], Урон=[2 + ef["🔶"], 2, 2 + ef["🔶"], 3],Ото=[" ","\033[1m\033[31m{}\033[0m".format("!"), "\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"]))," ", "\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"])),"\033[1m\033[31m{}\033[0m".format("!"), " "])
		elif h % 3 == 0:
			return ee(Выпуск=["⤈", 2, "⤈", 3], Урон=[2 + ef["🔶"], 0, 2 + ef["🔶"], 5], Ото=["\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"])), " ", "\033[1m\033[31m{}\033[0m".format("!"), " ", "\033[1m\033[31m{}\033[0m".format("!"), " ", "\033[1m\033[31m{}\033[0m".format(str(2 + ef["🔶"]))])
		return {"Имя":name,"Кабина":[3],"Отсек":[0,1,2,4,5,6],"Пушка":[0,1,2,4,5,6],"Остальное":[],"Твёрд":[0,1,2,3,4,5,6],"Броня":[],"Уязвимость":[],"Трещина":[],"1":" ∆_∆_∆ ","2":"◥#####◤","3":"∥▽∥◡∥▽∥","Корпус":18,"Щит":2}
	elif name=="Колесница":
		if h % 2 == 1:
			return ee(Выпуск=["⤈", 0, "⤈", 3],Усиление=["🔶",1],Ото=["\033[1m\033[31m{}\033[0m".format("!"), " ","\033[1m\033[32m{}\033[0m".format("#"), " ", "\033[1m\033[31m{}\033[0m".format("!")])
		elif h % 2 == 0:
			return ee(Урон=[3 + ef["🔶"], 0], Ото=[" ","\033[1m\033[31m{}\033[0m".format(str(3 + ef["🔶"]))," ", " ", " "])
		return {"Имя":name,"Кабина":[2],"Отсек":[0,4],"Пушка":[1],"Остальное":[3],"Твёрд":[0,1,2,3,4],"Броня":[3],"Уязвимость":[],"Трещина":[2],"1":" ∆_∆ ","2":"∥###∥","3":"~∥◡⛨~","Корпус":12,"Щит":8}


# ∆ ▲ ⟱ ⬆ ⤉ ⸕ ⇖ ⍓ о ⦻ ⊕
# ᐁ ▼ ⟰ ⬇ ⤈ ⸔ ⇘ ⇅

class card:
	def __init__(self,**k):
		f={"имя":"","выпуск":" ","манёвр":0,"вщит":0,"щит":0,"урон":-1,"цена":1,"перс":"","доп":"","статус":{"🔶":0,"🥾":0,"⭐":0,"↩":0,"↪":0,"🚘":0,"🌈":0,"🫧":0,"💾":0,"🩸":0,"📗":0,"🧧":0,"<🟢>":0,"🔫":0,"⚡":0,"⏰":0,"🛑":0,"🔥":0,"🛡":0,"🅿":0,"🚀":0,"🦠":0,"":0,"♦":0,"⇫":0,"⊥":0,"🥇":0,"🧱":0,"🪨":0,"😇":0,"✈":0,"🕸":0,"▩":0,"🪑":0,"⌚":0,"Добор":0},"встатус":{"🔶":0,"🥾":0,"⭐":0,"↩":0,"↪":0,"🚘":0,"🌈":0,"🫧":0,"💾":0,"🩸":0,"📗":0,"🧧":0,"<🟢>":0,"🔫":0,"⚡":0,"⏰":0,"🛑":0,"🔥":0,"🛡":0,"🅿":0,"🚀":0,"🦠":0,"":0,"♦":0,"⇫":0,"⊥":0,"🥇":0,"🧱":0,"🪨":0,"😇":0,"✈":0,"🕸":0,"▩":0,"🪑":0,"⌚":0}}
		for key, v in k.items():
			f[key]=v
		self.имя=f["имя"]
		self.урон=f["урон"]
		self.щит=f["щит"]
		self.манёвр=f["манёвр"]
		self.вщит=f["вщит"]
		self.выпуск=f["выпуск"]
		self.цена=f["цена"]
		self.статус=f["статус"]
		self.встатус=f["встатус"]
		self.доп=f["доп"]
		self.перс=f["перс"]
	def __repr__(self):
		if self.перс=="Диззи":
			return Dizzy(self.имя+"  ")
		elif self.перс=="Риггс":
			return Riggs(self.имя+"  ")
		elif self.перс=="Пери":
			return Peri(self.имя+"  ")
		elif self.перс=="Айзек":
			return Isaak(self.имя+"  ")
		elif self.перс=="Дрейк":
			return Dreik(self.имя+"  ")
		elif self.перс=="Макс":
			return Max(self.имя+"  ")
		elif self.перс=="Академия":
			return Academia(self.имя+"  ")
		elif self.перс=="Киса":
			return Kisa(self.имя+"  ")
		else:
			return self.имя
	def show(self,e):
		if self.имя!="Конец хода":
			rr=["⓿","❶","❷","❸","❹","❺","❻","❼","❽","❾","❿","⓫","⓬","⓭","⓮","⓯","⓰","⓱","⓲","⓳","⓴"]
			t=" "+rr[self.цена]
			if self.урон>-1:
				t+="  "+str(self.урон+e["🔶"]+e["♦"])+"🖍️"
			if self.щит>0:
				t+="  "+str(self.щит)+"🟦️"
			if self.манёвр>0:
				t+="  "+str(self.манёвр)+"<>"
			if self.вщит>0:
				t+="  "+str(self.вщит)+"🟪️"
			if self.выпуск!=" ":
				t+="  ("+str(self.выпуск)+") ⤴"
			for key, v in self.статус.items():
				if v!=0:
					t+="  "+str(v)+str(key)
			for key, v in self.встатус.items():
				if v!=0:
					t+="  "+str(v)+str(key)+" врагу"
			if self.доп!="":
				t+=" "+self.доп
			return t
		return ""

def cards(i):
	qqq=(card(перс="Киса",имя="🖍️ Базовый Выстрел",урон=1),card(перс="Киса",имя="🟦 Базовый щит",щит=1),card(перс="Киса",имя="<=> Базовый манёвр",манёвр=1),card(перс="Диззи",имя="🛡 Большой щит",щит=3,цена=2),card(перс="Диззи",имя="🟪 Блокирующий выстрел",урон=1,вщит=1),card(перс="Диззи",имя="➕ Разгон брони",щит=2,цена=2,доп="+1 мах🟦"),card(перс="Диззи",имя="🔘 Тревожная кнопка",щит=3,манёвр=1,доп="⬅️⬅️⬅️   ▟",цена=3),card(перс="Диззи",имя="🆚 В пылу битвы",урон=2,щит=1,вщит=1,цена=2),card(перс="Диззи",имя=" ⃗  Импульс",щит=1,доп="+1 за каждый сыгранный раз"),card(перс="Диззи",имя="🟪🟦 Защита на шару",щит=1,вщит=1),card(перс="Диззи",имя="🕸 Заряд оглушения",статус={"🕸":1},цена=0),card(перс="Диззи",имя="𐇜 Оглушающий выстрел",урон=0,доп="🕸"),card(перс="Диззи",имя="☢ Кислотная пушка",урон=2,встатус={"🩸":1},цена=3),card(перс="Диззи",имя="🔵 Блокирование блокировки",вщит=4,доп="-1 мах🟦",цена=0),card(перс="Диззи",имя=">|< Конвентер",доп="Х=🟦    <>+=Х    🟦=0"),card(перс="Диззи",имя="!!! Эми",доп="🟦=0   враг🟦=0  конец хода вр   конец хода    ▟",цена=3),card(перс="Диззи",имя="🕸🕸 Мультистан",урон=0,доп="🕸    ⬅️    повторить",цена=2),card(перс="Диззи",имя="➕🟦 Импульсный барьер",щит=1,доп="+1 мах🟦    ▟"),card(перс="Диззи",имя="🔰 Интервал обновления",вщит=2,статус={"⚡":1},доп="▟"),card(перс="Диззи",имя="🩸 Луч коррозии",встатус={"🩸":1},доп="▟",цена=2),card(перс="Диззи",имя="🦠 Митоз",статус={"🦠":1},доп="▟"),card(перс="Диззи",имя="⇫ Расплата!",цена=3,щит=1,доп="▟",статус={"⊥":1}),card(перс="Диззи",имя="🖍🟦 Щитовая пушка",доп="Х=🟦    🖍=Х",цена=2),card(перс="Диззи",имя="▩ Источник оглушения",статус={"▩":1},цена=4,доп="▟"),card(перс="Риггс",имя="<0> Болт",цена=0,манёвр=1,доп="▟"),card(перс="Риггс",имя="🗺 Вытягивающий выстрел",статус={"Добор":2},урон=1),card(перс="Риггс",имя="<🖍> Манёвренный выстрел",урон=1,манёвр=1),card(перс="Риггс",имя="↔️ Финт",доп="↔️↔️↔️"),card(перс="Риггс",имя="📗 Варианты",манёвр=1,статус={"📗":2}),card(перс="Риггс",имя="😱 Паника!",урон=0,щит=1,доп="️↔️↔️"),card(перс="Риггс",имя="🎴 Быстрая реакция",статус={"Добор":3}),card(перс="Риггс",имя="<<>> Мешанина",цена=2,манёвр=2),card(перс="Риггс",имя="<-| <-| |-> Захлёст",урон=2,доп="⬅️↔️"),card(перс="Риггс",имя="⌚ Заряженный выстрел",урон=0,доп="+2 за каждый раз, когда вытянута  ▟"),card(перс="Риггс",имя="Эхо Эхо Эхо",доп="Выберете карту из сброса, переместите в добор"),card(перс="Риггс",имя="🥾 Скороход",манёвр=1,статус={"🥾":1}),card(перс="Риггс",имя="⚠️ Сейчас или никогда!",манёвр=3,статус={"🅿":1},доп="▟"),card(перс="Риггс",имя="⚡📗 Приготовление",статус={"⚡":2,"📗":2},цена=2),card(перс="Риггс",имя="💡 Выборочная память",цена=0,доп="Выберете карту из добора, поместите в руку  ▟"),card(перс="Риггс",имя="🏁 Валим из рашки",манёвр=4,доп="↔️↔️↔️  ▟",цена=3),card(перс="Риггс",имя="⭐ В туза захожу",статус={"⭐":1},цена=3,доп="▟"),card(перс="Риггс",имя="🔫 Ручная пушка!",урон=0,цена=2,доп="По колличеству карт в руке"),card(перс="Риггс",имя="🏆 Вторые варианты",доп="▟",статус={"Добор":4},цена=0),card(перс="Риггс",имя="✈ Бреющий",цена=4,статус={"✈":1},доп="▟"),card(перс="Риггс",имя="🖼 Подумай дважды!",статус={"Добор":5},цена=0,доп="Сбросьте руку ▟"),card(перс="Пери",имя="♦ Эскалация",статус={"♦":1}),card(перс="Пери",имя="🔋 Экстра батарея",доп="+2 энергии  ▟",цена=0),card(перс="Пери",имя="<🟪 Спокойное движение",вщит=1,доп="⬅️⬅️"),card(перс="Пери",имя="🖍>> Выпад",урон=1,доп="➡️➡️"),card(перс="Пери",имя="💥💥 Серия взрывов",урон=2,цена=2,доп="повторить"),card(перс="Пери",имя="🖍🖍 Серия выстрелов",урон=1,доп="повторить"),card(перс="Пери",цена=2,имя="♦♦ Жёсткое усиление",статус={"♦":2},доп="▟"),card(перс="Пери",имя=">>> Побег",доп="➡️➡️➡️"),card(перс="Пери",имя="🌊 Волновой заряд",цена=2,доп="Добавляет '🌊 Волновой бум' в руку  ▟"),card(перс="Пери",имя="🖍>🖍>🖍 Ормада",цена=2,урон=1,доп="️➡️ повторить повторить"),card(перс="Пери",имя="🟥 Ремонт корпуса",цена=2,щит=1,доп="+1🟥  ▟"),card(перс="Пери",имя="🛡 Флюс",урон=1,цена=2,статус={"🛡":1}),card(перс="Пери",имя="🌫🖍 Передний заряд",урон=4,доп="+3 '🌫 дым' в добор"),card(перс="Пери",имя="🔶 Разгон в ущерб",статус={"🔶":1},доп="-1🟥  ▟",цена=2),card(перс="Пери",имя="🥾 Рёв мотора",статус={"🥾":1},доп="🧲  ▟"),card(перс="Пери",имя=">> Шажок в сторону",цена=0,доп="➡️  🧲"),card(перс="Пери",имя="🔫 Бесконечный магазин",статус={"🔫":1},цена=2,доп="▟"),card(перс="Пери",имя=">♦< Инвентер",доп="Х=🟦  ♦+=Х  🟦=0",цена=2),card(перс="Пери",имя="^🖍^ Парирование",цена=3,урон=0,доп="по общему урону врага  ▟"),card(перс="Пери",имя="🪑 Кулаком по столу",цена=2,статус={"🪑":1},доп="➡️  🔃  ▟"),card(перс="Пери",имя="💔 Наложение уязвимости",цена=3,урон=2,доп="уязвимость на место попадания  ▟"),card(перс="Айзек",имя="∆ Атакующий дрон",выпуск="∆"),card(перс="Айзек",имя="🟢 Гибкий ход",манёвр=1,цена=2,статус={"<🟢>":2}),card(перс="Айзек",имя="⬆ Ракетный выстрел",урон=2,цена=2,выпуск="⬆"),card(перс="Айзек",имя="🟢> Параллельный сдвиг",статус={"<🟢>":1},доп=" 🟩>"),card(перс="Айзек",имя="⟱ Защитный дрон",выпуск="⟱"),card(перс="Айзек",имя="➡️🟩> Шифт",урон=1,доп="➡️➡️🟩>🟩>"),card(перс="Айзек",имя="🪨 Маленький камушек",цена=0,выпуск="о"),card(перс="Айзек",имя="🔆 Солнечный ветер",доп="🟩>",статус={"Добор":1},цена=0),card(перс="Айзек",имя="⦻ Космическая мина",выпуск="⦻"),card(перс="Айзек",имя="⚔️ Ударный отряд",выпуск="1<∆ ⟱ 1>∆",цена=3,доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Набор валунов",цена=2,статус={"<🟢>":1},доп="даёт 3 гальки  ▟"),card(перс="Айзек",имя="🫧 Поле пузырей",цена=2,доп="Все объекты среднего ряда покрываются пузырями"),card(перс="Айзек",имя="о Большие валуны",доп="▟",цена=2,выпуск="1<о о 1>о"),card(перс="Айзек",имя="🎮 Радиоуправление",доп="Все дроны и ракеты срабатывают"),card(перс="Айзек",имя="⊕ Ремонтная мина",выпуск="⊕",цена=2,доп="▟"),card(перс="Айзек",имя="▲ Ударная эскадрилья",выпуск="1<▲ 1>▲",цена=2,статус={"⏰":2},доп="▟"),card(перс="Айзек",имя="🚀 Перегрузка отсека",цена=0,статус={"🚀":2},доп="+3 энергии  ▟"),card(перс="Айзек",имя="⥮ Энергнетический дрон",цена=2,выпуск="⥮"),card(перс="Айзек",имя="⍓ Дрон Юпитер",выпуск="⍓",доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Фабрика камней",статус={"🪨":1},доп="▟"),card(перс="Айзек",имя="🏎 Скедадл!",урон=1,цена=2,доп="⬅️⬅️⬅️⬅️<🟩<🟩"),card(перс="Дрейк",имя="🛻 Двигатель внутреннего сгорания",цена=0,доп="  по нагреву"),card(перс="Дрейк",имя="⚠️🟦 Отчайнные меры!",цена=0,щит=1,вщит=2,статус={"🔥":3},доп="▟"),card(перс="Дрейк",имя="🔥🕸 ЭМИ снаряд",урон=3,цена=2,доп="🕸",статус={"🔥":1}),card(перс="Дрейк",имя="❄️ Экзотермический выпуск",доп="-3🔥  пробивает  ▟",урон=1),card(перс="Дрейк",имя="🔥💥 Взрывная пуля",урон=2,доп="пробивает",статус={"🔥":1}),card(перс="Дрейк",имя="🟪🔥 Огненная стена",статус={"🔥":1},щит=1,вщит=1),card(перс="Дрейк",имя="❄>️ Радиатор масляный",доп="-1🔥  ➡️"),card(перс="Дрейк",имя="Горячий компресс",вщит=1,статус={"🔥":3},доп="+1🟥  ▟"),card(перс="Дрейк",имя="🦵 Горячая нога",статус={"🔥":1},манёвр=2,доп="▟"),card(перс="Дрейк",имя="🔹 Агрессивная броня",урон=3,цена=0,доп="броня на место попадания"),card(перс="Дрейк",имя="🌹 Чёрный передел",цена=0,урон=0,доп="равный нагреву, заканчивает ход"),card(перс="Дрейк",имя="♦🔥 Тепловая волна",цена=0,статус={"🔥":1,"♦":1}),card(перс="Дрейк",имя="🔥🔥 Ожог!",урон=2,цена=2,статус={"🔥":1},доп="пробивает  повторить"),card(перс="Дрейк",имя="🌤!!! Солнечный удар",цена=2,статус={"🔥":2},доп="заканчивает ход себя и врага  ▟"),card(перс="Дрейк",имя="🔄 Вентилятор",статус={"Сброс":1,"Добор":2},доп="-1🔥  ♾"),card(перс="Дрейк",имя="🌫🌫 Летучие пары",урон=3,доп="-1 мах🟦"),card(перс="Дрейк",имя="❄️🛑 Сухая заморозка",урон=1,встатус={"🛑":1}),card(перс="Дрейк",имя="😈 Восставший из ада!",урон=0,цена=3,доп="по отсутствующему здоровью"),card(перс="Дрейк",имя="🦴 Грабёжь и разбой!",цена=3,урон=2,доп="если убивает, то +2 🟥  ▟"),card(перс="Дрейк",имя="😇 Спокойствие",цена=0,статус={"😇":1,"Добор":1},доп="▟"),card(перс="Дрейк",имя="🔋🔥 Термальная батарея",статус={"🔥":1},доп="+1 энергии",цена=0),card(перс="Макс",имя="💻 Админская установка",доп="Разыграйте самую левую карту бесплатно и истощите её"),card(перс="Макс",имя="☁️ Облачное сохранение",доп="верните истощённую карту в руку  ▟"),card(перс="Макс",имя="🎲 Бросок кубика",цена=0,урон=1,статус={"Сброс":2},доп="♾"),card(перс="Макс",имя="🦙 Максов максимум",статус={"Добор":10,"🧧":2}),card(перс="Макс",имя="🫱 Тасовка",доп="🫱",вщит=2),card(перс="Макс",имя="🛶 Космоческое плавание",урон=1,статус={"🚘":1}),card(перс="Макс",имя="🖍🫱 Тасующий выстрел",урон=2,доп="🫱"),card(перс="Макс",имя="🩶🧲 Системная защита",щит=1,вщит=2,цена=2,доп="🧲"),card(перс="Макс",имя="🪱 Червь",вщит=2,доп="добавьте червя в сброс  🧲"),card(перс="Макс",имя="↪ Прогнозированный уворот",статус={"↪":1}),card(перс="Макс",имя="🌤 Как солнце из-за туч",встатус={"🔶":1},доп="отменяет намерения врага  ▟"),card(перс="Макс",имя="🚘 Мастер побега",статус={"🚘":2,"Добор":1},доп="🫱  ▟"),card(перс="Макс",имя="🥱 Ленивый обстрел",урон=1,цена=2,доп="️⬅️<🟩⬅️<🟩  повторить повторить"),card(перс="Макс",имя="🧠 Утечка памяти",урон=3,доп="статический шум в добор"),card(перс="Макс",имя="🫚 Root-доступ",цена=0,доп="самая правая карта получает магнит  ▟"),card(перс="Макс",имя="? Заглушка",цена=0,статус={"Добор":1},доп="🧲  ▟"),card(перс="Макс",имя="♊ Резервная копия",доп="создайте копию левой карты  ▟"),card(перс="Макс",имя="💾 Чистое очищение",цена=4,статус={"💾":1},доп="▟"),card(перс="Макс",имя="🌈 Разгон",цена=2,статус={"🌈":2},доп="▟"),card(перс="Макс",имя="⛰️ Сохранить позицию",доп="Сохрани координаты врага  ▟"),card(перс="Макс",имя="🧹 Очистка кеша",цена=2,урон=0,вщит=0,доп="очистить всю руку  ▟"),card(перс="Академия",имя="💎 Мерцающий выстрел",урон=0,доп="потеряйте все кристаллы, урон равный их удвоенному количеству  ▟"),card(перс="Академия",имя="💪 Рука мага",щит=1,доп="потратьте 💎 на урон 2"),card(перс="Академия",имя="Маги батарея",цена=0,доп="потратьте 💎💎💎 на +1 энерг.  🧲"),card(перс="Академия",имя="☄ Метеор",доп="➡️  🔃  потратьте 💎 на выпуск ☄"),card(перс="Академия",цена=0,имя="⛏️⛏️ Буровая установка",урон=0,статус={"💎":1},доп="Если 💎>1, то потратьте 💎💎 на урон 1"),card(перс="Академия",имя="🔷💎 Сапфировый щит",щит=1,статус={"💎":1}),card(перс="Академия",имя="💎 Хитрый сдвиг",доп="⬅️⬅️  потратьте 💎 на +2💎"),card(перс="Академия",имя="◆ Неполированный кристал",доп="добавьте в руку осколок  ▟"),card(перс="Академия",имя="⚡ Цирконовая молния",доп="➡️  🔃  потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр"),card(перс="Академия",имя="📖 Заядлый читатель",урон=3,доп="Обязан уже сыграть 4 карты в этот ход!"),card(перс="Академия",имя="🦕 Эволюция блока",щит=1,доп="потратьте 💎 на 1 щит  потратьте 💎 на 1 щит"),card(перс="Академия",имя="🖍🟥 Удар гематитом",урон=3,доп="-1🟥  потратьте 💎💎 за +1 ХП",цена=0),card(перс="Академия",имя="🎁 Подарок",доп="забирает объект в ракетный отсек  🧲  ▟"),card(перс="Академия",имя="💎☄ Камни в почках",выпуск="1<☄ ☄",доп="➡️  🔃",цена=2),card(перс="Академия",имя="💺 Старый добрый надёжный",цена=0,выпуск="☄",статус={"Добор":1},доп="▟"),card(перс="Академия",имя="💍 Осколочный пакет",цена=2,щит=1,доп="Поместите два осколка в добор  ▟"),card(перс="Академия",имя="🐉 Горюново поле",щит=1,доп="Весь средний ряд заменяется на жеоды"),card(перс="Академия",имя="🔶💍 Переполняющая мощь",статус={"💎":1,"💍":1},доп="потратьте 💎💎💎💎 на 1🔶"),card(перс="Академия",имя="💎💎 Идеальный образец",доп="+2🟥  Поместите два осколка в добор  👻▟"),card(перс="Академия",имя="⛏️⚒️ Квантовый карьер",статус={"⛏️":1},цена=2,доп="▟"),card(перс="Академия",имя="🌌 Нулевая вытяжка",цена=2,доп="Вытяните все бесплатные карты из сброса"),card(имя="🩸 Пиявка",цена=2,урон=2,доп="🕸  пробивает  +1🟥  ▟"),card(имя="🟥️ Эфемерный ремонт",доп="+4🟥 👻▟"),card(имя="🖍 Эфемерный взрыв",урон=7,цена=0,доп="👻▟"),card(имя="<> Эфемерное уклонение",манёвр=5,цена=0,доп="👻▟"),card(имя="🚀 Ракетный вред",урон=1,доп="пробивает  ▟",встатус={"🚀":1}),card(имя="⇖ Искатель",выпуск="⇖"),card(имя="🏥 Ушиб",доп="+1🟥  -1🟥"),card(имя="🖍🖍🖍 Картечь",урон=0,доп="повторить  повторить"),card(имя="🍾 Молния в бутылке",доп="+3 энергии  ▟",цена=3),card(имя="💃 Вальс",доп="⬅️⬅️➡️➡️"),card(перс="Киса",имя="▟ Базовая замена",цена=0,доп="▟",статус={"Добор":1}),card(перс="Киса",имя="<🟢> Стандартный сдвиг",статус={"<🟢>":1}),
	card(перс="Киса",имя="🖍️ Базовый Выстрел А",урон=1,цена=0),card(перс="Киса",имя="🟦 Базовый щит А",щит=1,цена=0),card(перс="Киса",имя="<=> Базовый манёвр А",манёвр=1,цена=0),card(перс="Диззи",имя="🛡 Большой щит А",щит=5,цена=2),card(перс="Диззи",имя="🟪 Блокирующий выстрел А",урон=2,щит=1),card(перс="Диззи",имя="➕ Разгон брони А",щит=3,цена=2,доп="+1 мах🟦"),card(перс="Диззи",имя="🔘 Тревожная кнопка А",щит=4,манёвр=2,доп="⬅️⬅️⬅️⬅️  ▟",цена=3),card(перс="Диззи",имя="🆚 В пылу битвы А",урон=3,щит=2,вщит=1,цена=2),card(перс="Диззи",имя=" ⃗  Импульс А",щит=1,статус={"Добор":1},доп="+1 за каждый сыгранный раз"),card(перс="Диззи",имя="🟪🟦 Защита на шару А",щит=2,вщит=1),card(перс="Диззи",имя="🕸 Заряд оглушения А",статус={"🕸":2},цена=0),card(перс="Диззи",имя="𐇜 Оглушающий выстрел А",урон=1,доп="🕸"),card(перс="Диззи",имя="☢ Кислотная пушка А",урон=2,встатус={"🩸":1},цена=2),card(перс="Диззи",имя="🔵 Блокирование блокировки",щит=1,вщит=4,доп="-1 мах🟦",цена=0),card(перс="Диззи",имя=">|< Конвентер А",цена=0,доп="Х=🟦    <>+=Х    🟦=0"),card(перс="Диззи",имя="!!! Эми А",доп="враг🟦=0  конец хода вр   конец хода    ▟",цена=3),card(перс="Диззи",имя="🕸🕸 Мультистан А",урон=0,доп="🕸    ⬅️⬅️    повторить повторить",цена=2),card(перс="Диззи",имя="➕🟦 Импульсный барьер А",цена=0,щит=1,доп="+1 мах🟦    ▟"),card(перс="Диззи",имя="🔰 Интервал обновления А",вщит=3,статус={"⚡":1},доп="▟"),card(перс="Диззи",имя="🩸 Луч коррозии А",встатус={"🩸":1},доп="▟"),card(перс="Диззи",имя="🦠 Митоз А",щит=2,статус={"🦠":1},доп="▟"),card(перс="Диззи",имя="⇫ Расплата! А",цена=3,щит=3,доп="▟",статус={"⊥":1}),card(перс="Диззи",имя="🖍🟦 Щитовая пушка",доп="Х=🟦    🖍=Х",щит=1,цена=2),card(перс="Диззи",имя="▩ Источник оглушения А",статус={"▩":1},цена=3,доп="▟"),card(перс="Риггс",имя="<0> Болт А",цена=0,манёвр=1),card(перс="Риггс",имя="🗺 Вытягивающий выстрел А",статус={"Добор":3},урон=1),card(перс="Риггс",имя="<🖍> Манёвренный выстрел А",урон=2,манёвр=1),card(перс="Риггс",имя="↔️ Финт А",доп="↔️↔️↔️↔️"),card(перс="Риггс",имя="📗 Варианты А",манёвр=2,статус={"📗":2}),card(перс="Риггс",имя="😱 Паника! А",урон=0,щит=1,доп="➡️➡️  🔃"),card(перс="Риггс",имя="🎴 Быстрая реакция А",статус={"Добор":5}),card(перс="Риггс",имя="<<>> Мешанина А",цена=2,манёвр=3),card(перс="Риггс",имя="<-| <-| |-> Захлёст А",урон=2,доп="⬅️⬅️↔️  🔃"),card(перс="Риггс",имя="⌚ Заряженный выстрел А",урон=0,доп="+3 за каждый раз, когда вытянута  ▟"),card(перс="Риггс",имя="Эхо Эхо Эхо А",доп="Выберете карту из сброса, переместите в добор",цена=0),card(перс="Риггс",имя="🥾 Скороход А",цена=0,манёвр=1,статус={"🥾":1}),card(перс="Риггс",имя="⚠️ Сейчас или никогда! А",цена=0,манёвр=3,статус={"🅿":1},доп="▟"),card(перс="Риггс",имя="⚡📗 Приготовление А",статус={"⚡":2,"📗":4},цена=2),card(перс="Риггс",имя="💡 Выборочная память А",цена=0,доп="Выберете две карты из добора, поместите в руку  ▟"),card(перс="Риггс",имя="🏁 Валим из рашки А",манёвр=4,доп="↔️↔️↔️  ▟",цена=2),card(перс="Риггс",имя="⭐ В туза захожу А",статус={"⭐":1},цена=2,доп="▟"),card(перс="Риггс",имя="🔫 Ручная пушка! А",урон=0,статус={"Добор":1},цена=2,доп="По колличеству карт в руке"),card(перс="Риггс",имя="🏆 Вторые варианты А",доп="▟",статус={"Добор":6},цена=0),card(перс="Риггс",имя="✈ Бреющий А",цена=3,статус={"✈":1},доп="▟"),card(перс="Риггс",имя="🖼 Подумай дважды! А",статус={"Добор":7},цена=0,доп="Сбросьте руку ▟"),card(перс="Пери",имя="♦ Эскалация А",цена=0,статус={"♦":1}),card(перс="Пери",имя="🔋 Экстра батарея А",доп="+3 энергии  ▟",цена=0),card(перс="Пери",имя="<🟪 Спокойное движение А",вщит=2,доп="⬅️⬅️"),card(перс="Пери",имя="🖍>> Выпад А",урон=1,доп="➡️➡️  🔃"),card(перс="Пери",имя="💥💥 Серия взрывов А",урон=3,цена=2,доп="повторить"),card(перс="Пери",имя="🖍🖍 Серия выстрелов А",урон=1,доп="повторить повторить"),card(перс="Пери",цена=1,имя="♦♦ Жёсткое усиление А",статус={"♦":2},доп="▟"),card(перс="Пери",имя=">>> Побег А",доп="➡️➡️➡️  🔃"),card(перс="Пери",имя="🌊 Волновой заряд А",урон=2,цена=2,доп="Добавляет '🌊 Волновой бум' в руку  ▟"),card(перс="Пери",имя="🖍>🖍>🖍 Ормада А",цена=2,урон=2,доп="️➡️ повторить повторить"),card(перс="Пери",имя="🟥 Ремонт корпуса А",щит=1,доп="+1🟥  ▟"),card(перс="Пери",имя="🛡 Флюс А",урон=1,статус={"🛡":1}),card(перс="Пери",имя="🌫🖍 Передний заряд А",урон=4,доп="+3 '🌫 дым' в добор"),card(перс="Пери",имя="🔶 Разгон в ущерб А",статус={"🔶":1},доп="-1🟥  ▟"),card(перс="Пери",имя="🥾 Рёв мотора А",статус={"🥾":2},доп="🧲  ▟"),card(перс="Пери",имя=">> Шажок в сторону А",цена=0,доп="➡️➡️  🧲"),card(перс="Пери",имя="🔫 Бесконечный магазин А",урон=2,статус={"🔫":1},цена=2,доп="▟"),card(перс="Пери",имя=">♦< Инвентер А",доп="Х=🟦  ♦+=Х  🟦=0"),card(перс="Пери",имя="^🖍^ Парирование А",цена=3,урон=0,доп="по общему урону врага"),card(перс="Пери",имя="🪑 Кулаком по столу А",статус={"🪑":1},доп="➡️  🔃  ▟"),card(перс="Пери",имя="💔 Наложение уязвимости А",цена=3,урон=2,доп="➡️  уязвимость на место попадания  повторить ▟"),card(перс="Айзек",имя="∆ Атакующий дрон А",выпуск="▲"),card(перс="Айзек",имя="🟢 Гибкий ход А",манёвр=1,статус={"<🟢>":2}),card(перс="Айзек",имя="⬆ Ракетный выстрел А",урон=3,цена=2,выпуск="⤉"),card(перс="Айзек",имя="🟢> Параллельный сдвиг",статус={"<🟢>":2}),card(перс="Айзек",имя="⟱ Защитный дрон А",выпуск="\033[1m\033[34m{}\033[0m".format("⟱")),card(перс="Айзек",имя="➡️🟩> Шифт А",урон=2,доп="➡️➡️🟩>🟩>"),card(перс="Айзек",имя="🪨 Маленький камушек А",цена=0,выпуск="\033[1m\033[34m{}\033[0m".format("о"),доп="🧲"),card(перс="Айзек",имя="🔆 Солнечный ветер А",доп="🟩>",статус={"Добор":1},цена=0),card(перс="Айзек",имя="⦻ Космическая мина А",выпуск="1<⦻ ⦻"),card(перс="Айзек",имя="⚔️ Ударный отряд А",выпуск="1<▲ ⟱ 1>▲",цена=3,доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Набор валунов А",цена=2,статус={"<🟢>":3},доп="даёт 3 гальки  ▟"),card(перс="Айзек",имя="🫧 Поле пузырей А",цена=2,статус={"<🟢>":2},доп="Все объекты среднего ряда покрываются пузырями"),card(перс="Айзек",имя="о Большие валуны А",цена=2,выпуск="1<о о 1>о"),card(перс="Айзек",имя="🎮 Радиоуправление А",цена=0,доп="Все дроны и ракеты срабатывают"),card(перс="Айзек",имя="⊕ Ремонтная мина А",выпуск="⊕",доп="▟"),card(перс="Айзек",имя="▲ Ударная эскадрилья А",выпуск="1<▲ 1>▲",цена=2,доп="▟"),card(перс="Айзек",имя="🚀 Перегрузка отсека А",цена=0,статус={"🚀":2,"Добор":1},доп="+3 энергии  ▟"),card(перс="Айзек",имя="⥮ Энергнетический дрон А",цена=2,выпуск="\033[1m\033[34m{}\033[0m".format("⥮")),card(перс="Айзек",имя="⍓ Дрон Юпитер А",цена=0,выпуск="⍓",доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Фабрика камней А",цена=0,статус={"🪨":1},доп="▟"),card(перс="Айзек",имя="🏎 Скедадл!",урон=1,цена=2,доп="⬅️⬅️⬅️⬅️<🟩<🟩  🔃"),card(перс="Дрейк",имя="🛻 Двигатель внутреннего сгорания А",цена=0,доп="  по нагреву  -1🔥"),card(перс="Дрейк",имя="⚠️🟦 Отчайнные меры! А",цена=0,щит=1,вщит=2,статус={"🔥":1},доп="▟"),card(перс="Дрейк",имя="🔥🕸 ЭМИ снаряд А",урон=4,цена=2,доп="🕸",статус={"🔥":1}),card(перс="Дрейк",имя="❄️ Экзотермический выпуск А",цена=0,доп="-3🔥  пробивает  ▟",урон=1),card(перс="Дрейк",имя="🔥💥 Взрывная пуля А",урон=3,доп="пробивает",статус={"🔥":1}),card(перс="Дрейк",имя="🟪🔥 Огненная стена А",доп="-1🔥",щит=1,вщит=1),card(перс="Дрейк",имя="❄>️ Радиатор масляный А",цена=0,доп="-1🔥  ➡️"),card(перс="Дрейк",имя="Горячий компресс А",вщит=1,статус={"🔥":2},доп="+1🟥  ▟"),card(перс="Дрейк",имя="🦵 Горячая нога А",доп="-1🔥  ▟",манёвр=2),card(перс="Дрейк",имя="🔹 Агрессивная броня А",урон=4,цена=0,доп="броня на место попадания"),card(перс="Дрейк",имя="🌹 Чёрный передел А",цена=0,урон=0,доп="равный нагреву"),card(перс="Дрейк",имя="♦🔥 Тепловая волна А",цена=0,статус={"♦":1},доп="-1🔥"),card(перс="Дрейк",имя="🔥🔥 Ожог! А",урон=2,цена=2,доп="пробивает  повторить"),card(перс="Дрейк",имя="🌤!!! Солнечный удар А",цена=2,статус={"🔥":1},доп="заканчивает ход себя и врага  ▟"),card(перс="Дрейк",имя="🔄 Вентилятор А",статус={"Добор":2},доп="-1🔥  ♾"),card(перс="Дрейк",имя="🌫🌫 Летучие пары",цена=0,урон=3,доп="-1 мах🟦"),card(перс="Дрейк",имя="❄️🛑 Сухая заморозка А",урон=2,встатус={"🛑":1}),card(перс="Дрейк",имя="😈 Восставший из ада! А",урон=0,цена=3,доп="по отсутствующему здоровью  +1🟥"),card(перс="Дрейк",имя="🦴 Грабёжь и разбой! А",урон=2,доп="если убивает, то +2 🟥  ▟"),card(перс="Дрейк",имя="😇 Спокойствие А",цена=0,статус={"😇":2,"Добор":1},доп="▟"),card(перс="Дрейк",имя="🔋🔥 Термальная батарея А",статус={"🔥":1,"Добор":1},доп="+1 энергии",цена=0),card(перс="Макс",имя="💻 Админская установка А",цена=0,доп="Разыграйте самую левую карту бесплатно и истощите её"),card(перс="Макс",имя="☁️ Облачное сохранение А",цена=0,доп="верните истощённую карту в руку  ▟"),card(перс="Макс",имя="🎲 Бросок кубика А",цена=0,урон=2,статус={"Сброс":2},доп="♾"),card(перс="Макс",имя="🦙 Максов максимум А",статус={"Добор":10,"🧧":1}),card(перс="Макс",имя="🫱 Тасовка А",доп="🫱",вщит=3),card(перс="Макс",имя="🛶 Космоческое плавание А",урон=2,статус={"🚘":1}),card(перс="Макс",имя="🖍🫱 Тасующий выстрел А",урон=3,доп="🫱"),card(перс="Макс",имя="🩶🧲 Системная защита А",щит=2,вщит=2,цена=2,доп="🧲"),card(перс="Макс",имя="🪱 Червь А",вщит=2,доп="добавьте червя А в руку  🧲"),card(перс="Макс",имя="↪ Прогнозированный уворот А",статус={"↪":2}),card(перс="Макс",имя="🌤 Как солнце из-за туч А",цена=0,встатус={"🔶":1},доп="отменяет намерения врага  ▟"),card(перс="Макс",имя="🚘 Мастер побега",статус={"🚘":2,"Добор":1},доп="🫱  🧲  ▟"),card(перс="Макс",имя="🥱 Ленивый обстрел А",урон=1,цена=2,доп="⬅️<🟩️⬅️<🟩⬅️<🟩  повторить повторить повторить"),card(перс="Макс",имя="🧠 Утечка памяти А",урон=3,цена=0,доп="статический шум в добор"),card(перс="Макс",имя="🫚 Root-доступ А",цена=0,доп="две самых правых карты получают магнит  ▟"),card(перс="Макс",имя="? Заглушка А",цена=0,вщит=1,статус={"Добор":1},доп="🧲  ▟"),card(перс="Макс",имя="♊ Резервная копия А",доп="создайте копию левой карты"),card(перс="Макс",имя="💾 Чистое очищение А",цена=3,статус={"💾":1},доп="▟"),card(перс="Макс",имя="🌈 Разгон А",статус={"🌈":2},доп="▟"),card(перс="Макс",имя="⛰️ Сохранить позицию",цена=0,доп="Сохрани координаты врага  ▟"),card(перс="Макс",имя="🧹 Очистка кеша А",цена=2,урон=0,вщит=0,доп="очистить всю руку  ▟"),card(перс="Академия",имя="💎 Мерцающий выстрел А",урон=0,доп="потеряйте все кристаллы, урон равный их удвоенному количеству"),card(перс="Академия",имя="💪 Рука мага А",щит=1,доп="потратьте 💎 на урон 3"),card(перс="Академия",имя="Маги батарея А",цена=0,доп="потратьте 💎💎 на +1 энерг.  🧲"),card(перс="Академия",имя="☄ Метеор А",выпуск="☄",доп="➡️  🔃"),card(перс="Академия",цена=0,имя="⛏️⛏️ Буровая установка А",урон=1,статус={"💎":1},доп="Если 💎>1, то потратьте 💎💎 на урон 2"),card(перс="Академия",имя="🔷💎 Сапфировый щит А",щит=1,статус={"💎":2}),card(перс="Академия",имя="💎 Хитрый сдвиг А",доп="⬅️⬅  🔃️  потратьте 💎 на +2💎"),card(перс="Академия",имя="◆ Неполированный кристал А",статус={"💎":1},доп="добавьте в руку осколок  ▟"),card(перс="Академия",имя="⚡ Цирконовая молния А",манёвр=1,доп="➡️  🔃  потратьте 💎 на 1 манёвр"),card(перс="Академия",имя="📖 Заядлый читатель А",урон=3,доп="Обязан уже сыграть 3 карты в этот ход!"),card(перс="Академия",имя="🦕 Эволюция блока А",щит=1,доп="потратьте 💎 на 2 щита"),card(перс="Академия",имя="🖍🟥 Удар гематитом А",урон=3,доп="-1🟥  потратьте 💎 за +1 ХП",цена=0),card(перс="Академия",имя="🎁 Подарок А",цена=0,доп="забирает объект в ракетный отсек  🧲  ▟"),card(перс="Академия",имя="💎☄ Камни в почках А",выпуск="2<☄ 1<☄",доп="➡️  🔃  потратьте 💎 на выпуск ☄",цена=2),card(перс="Академия",имя="💺 Старый добрый надёжный А",цена=0,выпуск="☄",статус={"Добор":1}),card(перс="Академия",имя="💍 Осколочный пакет А",цена=2,щит=3,доп="Поместите два осколка в добор  ▟"),card(перс="Академия",имя="🐉 Горюново поле А",цена=0,щит=1,доп="Весь средний ряд заменяется на жеоды"),card(перс="Академия",имя="🔶💍 Переполняющая мощь А",статус={"💎":1,"💍":1},доп="потратьте 💎💎💎💎 на 1🔶"),card(перс="Академия",имя="💎💎 Идеальный образец А",цена=0,доп="+4🟥  Поместите два осколка в добор  👻▟"),card(перс="Академия",имя="⛏️⚒️ Квантовый карьер А",статус={"⛏️":1,"💎":2},цена=2,доп="🧲▟"),card(перс="Академия",имя="🌌 Нулевая вытяжка А",доп="Вытяните все бесплатные карты из сброса"),card(имя="🩸 Пиявка А",цена=2,урон=3,доп="🕸  пробивает  +2🟥  ▟"),card(имя="🟥️ Эфемерный ремонт",доп="+4🟥 👻▟"),card(имя="🖍 Эфемерный взрыв",урон=7,цена=0,доп="👻▟"),card(имя="<> Эфемерное уклонение",манёвр=5,цена=0,доп="👻▟"),card(имя="🚀 Ракетный вред А",урон=2,доп="пробивает  ▟",встатус={"🚀":2}),card(имя="⇖ Искатель А",выпуск="⇖",доп="⬅️⬅️⬅️"),card(имя="🏥 Ушиб А",цена=0,доп="+1🟥  -1🟥"),card(имя="🖍🖍🖍 Картечь А",урон=0,доп="повторить  повторить повторить повторить"),card(имя="🍾 Молния в бутылке А",доп="+3 энергии",цена=3),card(имя="💃 Вальс А",доп="⬅️⬅⬅️⬅️➡️➡️️➡️➡"),card(перс="Киса",имя="▟ Базовая замена А",цена=0,доп="▟",статус={"Добор":2}),card(перс="Киса",имя="<🟢> Стандартный сдвиг А",цена=0,статус={"<🟢>":1}),
	card(перс="Киса",имя="🖍️ Базовый Выстрел Б",урон=2),card(перс="Киса",имя="🟦 Базовый щит Б",вщит=1,щит=1),card(перс="Киса",имя="<=> Базовый манёвр Б",цена=0,манёвр=2,доп="▟"),card(перс="Диззи",имя="🛡 Большой щит Б",щит=3,вщит=2,цена=2),card(перс="Диззи",имя="🟪 Блокирующий выстрел Б",урон=1,вщит=3),card(перс="Диззи",имя="➕ Разгон брони Б",щит=2,цена=2,доп="+2 мах🟦"),card(перс="Диззи",имя="🔘 Тревожная кнопка Б",щит=3,манёвр=1,доп="⬅️⬅️⬅️   🧲▟",цена=3),card(перс="Диззи",имя="🆚 В пылу битвы Б",урон=2,щит=1,вщит=1,цена=2,доп="+1 мах🟦"),card(перс="Диззи",имя=" ⃗  Импульс Б",щит=1,доп="+2 за каждый сыгранный раз"),card(перс="Диззи",имя="🟪🟦 Защита на шару Б",вщит=2,доп="+1 мах🟦"),card(перс="Диззи",имя="🕸 Заряд оглушения Б",вщит=1,статус={"🕸":1},цена=0),card(перс="Диззи",имя="𐇜 Оглушающий выстрел Б",статус={"🕸":1},урон=0,доп="🕸"),card(перс="Диззи",имя="☢ Кислотная пушка Б",урон=4,встатус={"🩸":1},цена=3),card(перс="Диззи",имя="🔵 Блокирование блокировки Б",вщит=6,доп="-2 мах🟦",цена=0),card(перс="Диззи",имя=">|< Конвентер Б",цена=3,доп="Х=🟦    <>+=Х"),card(перс="Диззи",имя="!!! Эми Б",доп="🟦=0   враг🟦=0  конец хода вр   конец хода    ▟",цена=2),card(перс="Диззи",имя="🕸🕸 Мультистан Б",урон=1,доп="🕸    ⬅️    повторить",цена=2),card(перс="Диззи",имя="➕🟦 Импульсный барьер Б",щит=1,доп="+2 мах🟦    ▟"),card(перс="Диззи",имя="🔰 Интервал обновления Б",вщит=1,цена=0,статус={"⚡":1},доп="▟"),card(перс="Диззи",имя="🩸 Луч коррозии Б",встатус={"🩸":2},доп="▟",цена=3),card(перс="Диззи",имя="🦠 Митоз Б",статус={"🦠":2},доп="▟"),card(перс="Диззи",имя="⇫ Расплата! Б",цена=4,щит=2,доп="▟",статус={"⊥":2}),card(перс="Диззи",имя="🖍🟦 Щитовая пушка Б",доп="Х=🟦+🟪    🖍=Х",цена=2),card(перс="Диззи",имя="▩ Источник оглушения Б",статус={"▩":1},урон=4,цена=4,доп="🕸  ▟"),card(перс="Риггс",имя="<0> Болт",цена=0,манёвр=2,доп="▟"),card(перс="Риггс",имя="🗺 Вытягивающий выстрел Б",статус={"Добор":2},урон=2),card(перс="Риггс",имя="<🖍> Манёвренный выстрел Б",урон=2,манёвр=2,доп="▟"),card(перс="Риггс",имя="↔️ Финт Б",манёвр=1,доп="↔️↔️"),card(перс="Риггс",имя="📗 Варианты Б",манёвр=1,статус={"📗":2,"Добор":2}),card(перс="Риггс",имя="😱 Паника! Б",урон=0,щит=1,доп="️↔️↔️    повторить"),card(перс="Риггс",имя="🎴 Быстрая реакция Б",цена=0,доп="▟",статус={"Добор":3}),card(перс="Риггс",имя="<<>> Мешанина Б",цена=2,манёвр=2,доп="↔️↔️"),card(перс="Риггс",имя="<-| <-| |-> Захлёст Б",урон=3,доп="⬅️↔️"),card(перс="Риггс",имя="⌚ Заряженный выстрел Б",урон=0,доп="+1 за каждый раз, когда вытянута"),card(перс="Риггс",имя="Эхо Эхо Эхо Б",доп="Выберете карту из сброса, переместите в руку"),card(перс="Риггс",имя="🥾 Скороход Б",манёвр=1,статус={"🥾":2}),card(перс="Риггс",имя="⚠️ Сейчас или никогда! Б",манёвр=3,статус={"🅿":1}),card(перс="Риггс",имя="⚡📗 Приготовление А",статус={"⚡":3,"📗":2},цена=2),card(перс="Риггс",имя="💡 Выборочная память Б",цена=0,доп="Перемещает все карты в добор. Выберете карту из добора, поместите в руку  ▟"),card(перс="Риггс",имя="🏁 Валим из рашки Б",манёвр=6,доп="↔️↔️↔️  ▟",цена=3),card(перс="Риггс",имя="⭐ В туза захожу Б",манёвр=2,статус={"⭐":1},цена=3,доп="▟"),card(перс="Риггс",имя="🔫 Ручная пушка! Б",урон=0,цена=2,доп="По колличеству карт в руке ×2"),card(перс="Риггс",имя="🏆 Вторые варианты Б",статус={"Добор":2}),card(перс="Риггс",имя="✈ Бреющий Б",цена=4,статус={"✈":2},доп="▟"),card(перс="Риггс",имя="🖼 Подумай дважды! Б",статус={"Добор":3},цена=0,доп="Сбросьте руку"),card(перс="Пери",имя="♦ Эскалация Б",статус={"♦":1},доп="🧲"),card(перс="Пери",имя="🔋 Экстра батарея Б",статус={"⚡":1},доп="+2 энергии  ▟",цена=0),card(перс="Пери",имя="<🟪 Спокойное движение Б",вщит=1,манёвр=1,доп="⬅️"),card(перс="Пери",имя="🖍>> Выпад Б",урон=1,доп="➡️➡️  повторить"),card(перс="Пери",имя="💥💥 Серия взрывов Б",урон=2,цена=1,доп="♾"),card(перс="Пери",имя="🖍🖍 Серия выстрелов Б",урон=1,доп="повторить  пробивание"),card(перс="Пери",цена=2,имя="♦♦ Жёсткое усиление Б",статус={"♦":2}),card(перс="Пери",имя=">>> Побег Б",доп="➡️➡️➡️",урон=1),card(перс="Пери",имя="🌊 Волновой заряд Б",цена=2,доп="Добавляет два '🌊 Волновой бум' в руку  ▟"),card(перс="Пери",имя="🖍>🖍>🖍 Ормада Б",цена=2,урон=1,доп="️➡️️➡️️➡️️➡️ повторить повторить"),card(перс="Пери",имя="🟥 Ремонт корпуса Б",цена=2,щит=2,доп="+4🟥  🧲  👻▟"),card(перс="Пери",имя="🛡 Флюс Б",урон=2,цена=2,статус={"🛡":2},доп="▟"),card(перс="Пери",имя="🌫🖍 Передний заряд Б",урон=4,цена=0,доп="+3 '🌫 дым' в добор"),card(перс="Пери",имя="🔶 Разгон в ущерб Б",статус={"🔶":1},доп="▟",цена=3),card(перс="Пери",имя="🥾 Рёв мотора Б",статус={"🥾":1,"Добор":2},доп="🧲  ▟"),card(перс="Пери",имя=">> Шажок в сторону Б",цена=0,статус={"Добор":1},доп="➡️  🧲"),card(перс="Пери",имя="🔫 Бесконечный магазин Б",статус={"🔫":1},цена=2),card(перс="Пери",имя=">♦< Инвентер Б",доп="Х=🟦  ♦+=Х  🟦=2"),card(перс="Пери",имя="^🖍^ Парирование Б",цена=3,урон=0,доп="по общему урону врага  🧲  ▟"),card(перс="Пери",имя="🪑 Кулаком по столу Б",цена=2,статус={"🪑":1},доп="➡️➡️➡️  🔃  ▟"),card(перс="Пери",имя="💔 Наложение уязвимости Б",цена=3,урон=2,доп="трещина на место попадания  ▟"),card(перс="Айзек",имя="∆ Атакующий дрон Б",выпуск="\033[1m\033[34m{}\033[0m".format("∆")),card(перс="Айзек",имя="🟢 Гибкий ход Б",манёвр=2,цена=2,статус={"<🟢>":2}),card(перс="Айзек",имя="⬆ Ракетный выстрел Б",урон=2,цена=2,выпуск="⸕",доп="пробивание  ▟"),card(перс="Айзек",имя="🟢> Параллельный сдвиг Б",статус={"<🟢>":3},доп="▟"),card(перс="Айзек",имя="⟱ Защитный дрон Б",цена=2,выпуск="1<⟱ ⟱"),card(перс="Айзек",имя="➡️🟩> Шифт Б",урон=1,доп="➡️➡️➡️🟩>🟩>🟩>"),card(перс="Айзек",имя="🪨 Маленький камушек Б",цена=0,выпуск="1<о 1>о",доп="▟"),card(перс="Айзек",имя="🔆 Солнечный ветер Б",доп="🟩>🟩>",статус={"Добор":1},цена=0),card(перс="Айзек",имя="⦻ Космическая мина Б",доп="🟩>🟩>",выпуск="⦻"),card(перс="Айзек",имя="⚔️ Ударный отряд Б",выпуск="1<∆ ⟱ 1>∆ 2>⟱",цена=3,доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Набор валунов Б",цена=2,доп="даёт 3 гальки А  ▟"),card(перс="Айзек",имя="🫧 Поле пузырей Б",цена=0,доп="Все объекты среднего ряда покрываются пузырями ▟"),card(перс="Айзек",имя="о Большие валуны Б",доп="▟",цена=2,выпуск="2<о 1<о о 1>о 2>о"),card(перс="Айзек",имя="🎮 Радиоуправление",доп="Все дроны и ракеты срабатывают  🧲"),card(перс="Айзек",имя="⊕ Ремонтная мина А",выпуск="4>⊕",цена=0,доп="▟"),card(перс="Айзек",имя="▲ Ударная эскадрилья Б",выпуск="1<"+"\033[1m\033[34m{}\033[0m".format("▲")+" 1>"+"\033[1m\033[34m{}\033[0m".format("▲"),цена=2,статус={"⏰":2},доп="▟"),card(перс="Айзек",имя="🚀 Перегрузка отсека Б",цена=0,статус={"🚀":1},доп="+2 энергии  ▟"),card(перс="Айзек",имя="⥮ Энергнетический дрон Б",цена=0,выпуск="⥮",доп="▟"),card(перс="Айзек",имя="⍓ Дрон Юпитер Б",выпуск="\033[1m\033[34m{}\033[0m".format("⍓"),доп="▟"),card(перс="Айзек",имя="🪨🪨🪨 Фабрика камней Б",статус={"🪨":1},выпуск="о 1>о",доп="▟"),card(перс="Айзек",имя="🏎 Скедадл! Б",урон=3,цена=2,доп="⬅️⬅️⬅️⬅️<🟩<🟩"),card(перс="Дрейк",имя="🛻 Двигатель внутреннего сгорания Б",цена=0,статус={"🔥":2},доп="  по нагреву"),card(перс="Дрейк",имя="⚠️🟦 Отчайнные меры! Б",цена=0,щит=2,вщит=3,статус={"🔥":4},доп="▟"),card(перс="Дрейк",имя="🔥🕸 ЭМИ снаряд Б",урон=5,цена=2,доп="🕸",статус={"🔥":2}),card(перс="Дрейк",имя="❄️ Экзотермический выпуск Б",доп="-3🔥  пробивает  ▟",урон=3),card(перс="Дрейк",имя="🔥💥 Взрывная пуля Б",урон=2,доп="пробивает  повторить",статус={"🔥":2}),card(перс="Дрейк",имя="🟪🔥 Огненная стена Б",статус={"🔥":2},щит=2,вщит=2),card(перс="Дрейк",имя="❄>️ Радиатор масляный Б",доп="-1🔥  ➡️➡️  🔃"),card(перс="Дрейк",имя="Горячий компресс Б",цена=0,вщит=1,статус={"🔥":3},доп="+1🟥  ▟"),card(перс="Дрейк",имя="🦵 Горячая нога Б",статус={"🔥":1},манёвр=3,доп="▟"),card(перс="Дрейк",имя="🔹 Агрессивная броня Б",урон=3,цена=0,доп="броня на место попадания  ➡️  повторить"),card(перс="Дрейк",имя="🌹 Чёрный передел",статус={"🔥":2},цена=0,урон=0,доп="равный нагреву, заканчивает ход"),card(перс="Дрейк",имя="♦🔥 Тепловая волна Б",цена=2,статус={"🔥":2,"🔶":1},доп="▟"),card(перс="Дрейк",имя="🔥🔥 Ожог! Б",урон=2,цена=2,статус={"🔥":2},доп="пробивает  🕸  повторить"),card(перс="Дрейк",имя="🌤!!! Солнечный удар Б",цена=1,статус={"🔥":3},доп="заканчивает ход врага  ▟"),card(перс="Дрейк",имя="🔄 Вентилятор",статус={"Сброс":2,"Добор":4},доп="-2🔥  ♾"),card(перс="Дрейк",имя="🌫🌫 Летучие пары Б",щит=1,урон=3,доп="-1 мах🟦"),card(перс="Дрейк",имя="❄️🛑 Сухая заморозка Б",урон=2,встатус={"🛑":2},доп="➡️➡️  ▟"),card(перс="Дрейк",имя="😈 Восставший из ада! Б",урон=0,цена=3,доп="по отсутствующему здоровью  устанавливает здоровье на 0"),card(перс="Дрейк",имя="🦴 Грабёжь и разбой!",цена=3,урон=3,доп="если убивает, то +2 🟥  пробивание  ▟"),card(перс="Дрейк",имя="😇 Спокойствие",цена=0,статус={"😇":1,"Добор":3},доп="▟"),card(перс="Дрейк",имя="🔋🔥 Термальная батарея Б",статус={"🔥":2},доп="+2 энергии",цена=0),card(перс="Макс",имя="💻 Админская установка Б",доп="Разыграйте самую левую карту бесплатно"),card(перс="Макс",имя="☁️ Облачное сохранение Б",доп="верните две истощённые карты в руку  ▟"),card(перс="Макс",имя="🎲 Бросок кубика Б",цена=0,вщит=1,урон=1,статус={"Сброс":2},доп="♾"),card(перс="Макс",имя="🦙 Максов максимум Б",цена=0,статус={"Добор":10,"🧧":1},доп="▟"),card(перс="Макс",имя="🫱 Тасовка Б",доп="🫱",щит=2),card(перс="Макс",имя="🛶 Космоческое плавание Б",урон=1,статус={"🚘":1,"Добор":1}),card(перс="Макс",имя="🖍🫱 Тасующий выстрел Б",урон=3,цена=0,доп="🫱  ▟"),card(перс="Макс",имя="🩶🧲 Системная защита Б",щит=1,вщит=3,цена=2,доп="🧲"),card(перс="Макс",имя="🪱 Червь Б",цена=0,щит=1,доп="добавьте червя Б в сброс"),card(перс="Макс",имя="↪ Прогнозированный уворот Б",статус={"↩":1},цена=2,доп="▟"),card(перс="Макс",имя="🌤 Как солнце из-за туч Б",встатус={"🔶":2},статус={"Добор":1},цена=0,доп="+1 энергии  отменяет намерения врага  ▟"),card(перс="Макс",имя="🚘 Мастер побега Б",статус={"🚘":2,"Добор":1},доп="🫱"),card(перс="Макс",имя="🥱 Ленивый обстрел Б",урон=1,цена=2,доп="️⬅️⬅️️⬅️<🟩⬅️<🟩  повторить повторить"),card(перс="Макс",имя="🧠 Утечка памяти Б",урон=4,доп="статический шум в руку"),card(перс="Макс",имя="🫚 Root-доступ Б",цена=1,доп="самая правая карта получает магнит"),card(перс="Макс",имя="? Заглушка Б",цена=0,статус={"Добор":1},доп="️⬅️  🧲  ▟"),card(перс="Макс",имя="♊ Резервная копия Б",доп="создайте копию выбранной карты  ▟"),card(перс="Макс",имя="💾 Чистое очищение Б",цена=4,статус={"💾":1,"Добор":2},доп="▟"),card(перс="Макс",имя="🌈 Разгон Б",цена=2,статус={"🌈":2,"Добор":2},доп="▟"),card(перс="Макс",имя="⛰️ Сохранить позицию Б",доп="Сохрани координаты врага"),card(перс="Макс",имя="🧹 Очистка кеша Б",урон=0,цена=3,вщит=0,доп="очистить всю руку  🧲  ▟"),card(перс="Академия",имя="💎 Мерцающий выстрел Б",урон=0,доп="потеряйте все кристаллы, урон равный их утроенному количеству  🧲  ▟"),card(перс="Академия",имя="💪 Рука мага Б",урон=2,доп="потратьте 💎 на 2 щита"),card(перс="Академия",имя="Маги батарея Б",цена=0,доп="потратьте 💎 на добор 1  потратьте 💎💎 на +1 энерг.  🧲"),card(перс="Академия",имя="☄ Метеор Б",доп="➡️➡️  🔃  потратьте 💎 на выпуск ☄"),card(перс="Академия",цена=0,имя="⛏️⛏️ Буровая установка Б",урон=0,статус={"💎":2},доп="потратьте 💎 на урон 1"),card(перс="Академия",имя="🔷💎 Сапфировый щит Б",щит=2,статус={"💎":1}),card(перс="Академия",имя="💎 Хитрый сдвиг Б",доп="⬅️⬅️⬅️  потратьте 💎 на +3💎"),card(перс="Академия",имя="◆ Неполированный кристал Б",доп="Поместите два осколка в добор  ▟"),card(перс="Академия",имя="⚡ Цирконовая молния Б",доп="➡️  🔃  потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр"),card(перс="Академия",имя="📖 Заядлый читатель Б",урон=4,доп="Обязан уже сыграть 4 карты в этот ход!"),card(перс="Академия",имя="🦕 Эволюция блока Б",вщит=1,доп="потратьте 💎💎 на 3 щита"),card(перс="Академия",имя="🖍🟥 Удар гематитом Б",урон=3,доп="-1🟥  потратьте 💎💎 за +2 ХП  ▟",цена=0),card(перс="Академия",имя="🎁 Подарок Б",доп="забирает объект в ракетный отсек"),card(перс="Академия",имя="💎☄ Камни в почках Б",выпуск="1<☄ ☄",доп="➡️➡️➡️  🔃",цена=2),card(перс="Академия",имя="💺 Старый добрый надёжный Б",цена=0,выпуск="1<☄ ☄",статус={"Добор":1},доп="▟"),card(перс="Академия",имя="💍 Осколочный пакет Б",цена=2,щит=1,доп="Поместите три осколка в сброс  ▟"),card(перс="Академия",имя="🐉 Горюново поле Б",щит=1,доп="Весь средний ряд заменяется на жеоды  🧲"),card(перс="Академия",имя="🔶💍 Переполняющая мощь Б",статус={"💎":1,"💍":1},доп="потратьте 💎💎💎💎💎 на 2🔶"),card(перс="Академия",имя="💎💎 Идеальный образец Б",доп="+2🟥  Поместите осколок в добор  ▟"),card(перс="Академия",имя="⛏️⚒️ Квантовый карьер Б",статус={"⛏️":1,"💎":1},цена=2,доп="▟"),card(перс="Академия",имя="🌌 Нулевая вытяжка",цена=0,доп="+1 энергия  Вытяните все бесплатные карты из сброса  ▟"),card(имя="🩸 Пиявка Б",цена=2,урон=2,доп="🕸  пробивает  +1🟥"),card(имя="🟥️ Эфемерный ремонт Б",доп="+4🟥 👻▟"),card(имя="🖍 Эфемерный взрыв",урон=7,цена=0,доп="👻▟"),card(имя="<> Эфемерное уклонение",манёвр=5,цена=0,доп="👻▟"),card(имя="🚀 Ракетный вред Б",урон=1,доп="пробивает",встатус={"🚀":1}),card(имя="⇖ Искатель Б",цена=2,выпуск="3<⇖ ⇖"),card(имя="🏥 Ушиб Б",цена=0,доп="+1🟥  -1🟥"),card(имя="🖍🖍🖍 Картечь Б",урон=0,доп="пробивание повторить  повторить"),card(имя="🍾 Молния в бутылке Б",статус={"Добор":1},доп="+3 энергии  ▟",цена=3),card(имя="💃 Вальс Б",урон=0,доп="⬅️⬅️➡️➡️"),card(перс="Киса",имя="▟ Базовая замена Б",цена=0,статус={"Добор":1}),card(перс="Киса",имя="<🟢> Стандартный сдвиг Б",статус={"<🟢>":2},доп="▟"))
	return qqq[i]

def battle(sship,life,mlife,colod,razm,nam,mdefe,defe,re):
	enef={"🔶":0,"🥾":0,"⭐":0,"↩":0,"↪":0,"🚘":0,"🌈":0,"🫧":0,"💾":0,"🩸":0,"📗":0,"🧧":0,"<🟢>":0,"🔫":0,"⚡":0,"⏰":0,"🛑":0,"🔥":0,"🛡":0,"🅿":0,"🚀":0,"🦠":0,"♦":0,"⇫":0,"⊥":0,"🥇":0,"🧱":0,"🪨":0,"😇":0,"✈":0,"🕸":0,"▩":0,"🪑":0,"⌚":0,"Добор":0,"Сброс":0,"💎":0,"💍":0,"⛏️":0}
	vs=ene(nam)
	midl=[" "]*55+["\n"]
	ship1=midl.copy()
	vta=colod.copy()
	burn=[]
	vdefe=vbron=0
	mener=ener=3
	ef=enef.copy()
	sbros=[]
	mhp=hp=vs["Корпус"]
	mbron=bron=vs["Щит"]
	hod=manevr=0
	if "🐒 Обезьянья кабина" in re:
		for i in vs["Кабина"]:
			if i in vs["Броня"]:
				vs["Броня"].remove(i)
			if not(i in vs["Трещина"]):
				vs["Уязвимость"].append(i)
	if "🤯 Обнаружение трещин" in re:
		s=vs["Твёрд"].copy()
		for i in range(len(s)):
			if s[i] in vs["Броня"]:
				s.pop(i)
				i-=1
			if s[i] in vs["Уязвимость"]:
				s.pop(i)
				i-=1
			if s[i] in vs["Трещина"]:
				s.pop(i)
				i-=1
		vs["Трещина"].append(random.choice(s))
	if not("🧠 Щиты с памятью" in re):
		defe=0
	if "⛨ Предполётная подготовка" in re:
		manevr+=1
		defe+=1
	if "🪫 Зарядное устройство" in re:
		zaradn=0
	if "⏺ Слинковка" in re:
		slink=0
	if "⛖ Реакционный двигатель" in re:
		manevr+=2
	if "🔋 Аккумулятор Плюшкина" in re:
		ener+=1
	for i in range(len(vta)):
		vta[i]=cards(vta[i])
		if vta[i].перс=="Академия":
			ef["💍"]=3
	ha=[]
	sdwig=28-(len(vs["3"])-1)//2
	_sdwig=28-(len(sship["1"])-1)//2
	while hp>0 and life>0:
		if enef["🧱"]>0:
			vs["Броня"]=ene(nam)["Броня"]
			vs["Трещина"]=ene(nam)["Трещина"]
		vdefe=0
		if "🔌 Соединительный контур" in re and hod==0:
			vdefe+=mlife-life
		hod+=1
		if ef["🅿"]>0:
			ef["🅿"]=0
			manevr=0
		pr=False
		if "💣 Бронебойник" in re:
			pr=True
		ef["🕸"]+=ef["▩"]
		if "▩ Калибратор оглушения" in re:
			kalib=True
		if defe>0:
			defe-=ef["🦠"]
			vdefe+=2*ef["🦠"]
		if defe<0:
			defe=0
		ener=mener+ef["⚡"]-ef["⏰"]
		ef["⚡"]=ef["⏰"]=0
		manevr+=ef["⭐"]
		var=ene(nam,hod,enef,midl,sdwig,sship)
		for ii in range(ef["🪨"]):
			uvrag=[" "]*55+["\n"]
			if ef["🫧"]==0:
				uship[sship["Отсек"][0]+_sdwig]="о"
			else:
				uship[sship["Отсек"][0]+_sdwig]="\033[1m\033[34m{}\033[0m".format("о")
			print("\033[H\033[2J")
			print(vrag)
			print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
			print(ship,"\n")
			sleep(0.2)
			uship[sship["Отсек"][0]+_sdwig]=" "
			if midl[sship["Отсек"][0]+_sdwig]==" ":
				if ef["🫧"]==0:
					midl[sship["Отсек"][0]+_sdwig]="о"
				else:
					midl[sship["Отсек"][0]+_sdwig]="\033[1m\033[34m{}\033[0m".format("о")
			else:
				if blue(midl[sship["Отсек"][0]+_sdwig]):
					midl[sship["Отсек"][0]+_sdwig]=recolor(midl[sship["Отсек"][0]+_sdwig])
				else:
					midl[sship["Отсек"][0]+_sdwig]="💥"
			print("\033[H\033[2J")
			print(vrag)
			print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
			print(ship,"\n")
			sleep(0.2)
			if midl[sship["Отсек"][0]+_sdwig]=="💥":
				midl[sship["Отсек"][0]+_sdwig]=" "
			if ef["🫧"]>0:
				ef["🫧"]-=1
		r=razm
		for i in range(len(ha)):
			if "🧲" in ha[i].доп:
				r+=1
		r+=ef["📗"]-ef["🧧"]
		ef["📗"]=ef["🧧"]=0
		ef["💎"]+=ef["⛏️"]
		random.shuffle(vta)
		random.shuffle(sbros)
		if len(vta)<r:
			if "🗂 Острые края" in re:
				hp-=1
			for i in range(len(vta)):
				ha.append(vta.pop(0))
			vta.extend(sbros)
			sbros=[]
			while len(ha)<r and len(vta)!=0:
				ha.append(vta.pop(0))
		else:
			for i in range(r):
				ha.append(vta.pop(0))
		if sship["Имя"]=="Юпитер":
			True==True
		if sship["Имя"]=="Арес":
			for i in ha:
				if "♂" in i.имя:
					True==True
				else:
					ha.append(card(перс="Киса",имя="♂ Тумблер пушек"))
					break
		for i in range(ef["🔫"]):
			r+=1
			ha.append(card(перс="Пери",имя="🖍 Осколочный выстрел",урон=1,цена=0,доп="▟"))
		ha.append(card(имя="Конец хода"))
		while ha[r].имя!="Конец хода":
			vta.append(ha.pop(-2))
		book=0
		tt,ttt,z=" ","",0
		if enef["🛑"]>0:
			enef["🛑"]-=1
		if hod>1:
			if var["Движ"]==-666 and enef["🛑"]==0:
						if vs["Пушка"]!=[]:
							k=-sdwig-vs["Пушка"][len(vs["Пушка"])//4]+random.randint(_sdwig,_sdwig+len(sship["1"])-1)
						else:
							k=-sdwig-vs["Отсек"][len(vs["Отсек"])//4]+random.randint(_sdwig,_sdwig+len(sship["1"])-1)
						for i in range(abs(k)):
							sdwig+=k//abs(k)
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
			elif var["Движ"]!=-666 and enef["🛑"]==0:
						k=var["Движ"]
						for i in range(abs(k)):
							sdwig+=k//abs(k)
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
		for i in range(len(ha)):
			if ha[i].имя=="Обход защиты":
				vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,1,defe,life,var,mhp,mbron,re,pr)
				pr=False
				if "▩ Калибратор оглушения" in re:
					if kalib:
						ef["🕸"]+=1
						kalib=False
				if "⏺ Слинковка" in re:
					slink+=1
		if "🏭 Разогнанный генератор" in re and hod%3==0:
			ener+=1
		for i in ha:
			if i.имя=="⌚ Заряженный выстрел":
				i.урон+=2
			if i.имя=="⌚ Заряженный выстрел А":
				i.урон+=3
			if i.имя=="⌚ Заряженный выстрел Б":
				i.урон+=1


		while hp>0 and life>0:
			if ef["💎"]>ef["💍"]:
				ef["💎"]=ef["💍"]
			if "⏺ Слинковка" in re:
				if slink==5:
					slink=0
					manevr+=1
			while ef["Сброс"]>0:
				ef["Сброс"]-=1
				if len(ha)>1 and ha[0].имя!="Конец хода":
					r-=1
					sbros.append(ha.pop(0))
			while ef["Добор"]>0:
				ef["Добор"]-=1
				if len(vta)>0:
					r+=1
					random.shuffle(vta)
					ha.insert(r-1,vta.pop(0))
				elif len(sbros)>0:
					if "🗂 Острые края" in re:
						hp-=1
					r+=1
					random.shuffle(sbros)
					ha.insert(r-1,sbros.pop(0))
			if life>mlife:
				life=mlife
			if hp>mhp:
				hp=mhp
			if defe>mdefe:
				defe=mdefe
			if bron>mbron:
				bron=mbron
			uvrag=[" "]*55+["\n"]
			uship=[" "]*55+["\n"]
			ship1=[" "]*55+["\n"]
			ship2=[" "]*55+["\n"]
			ship3=[" "]*55+["\n"]
			for i in range(len(sship["1"])):
				if i in sship["Броня"]:
					ship1[28+i-(len(sship["1"])-1)//2]="\033[1m\033[34m{}\033[0m".format(sship["1"][i])
				elif i in sship["Уязвимость"]:
					ship1[28+i-(len(sship["1"])-1)//2]="\033[1m\033[33m{}\033[0m".format(sship["1"][i])
				elif i in sship["Трещина"]:
					ship1[_sdwig+i]="\033[1m\033[31m{}\033[0m".format(sship["1"][i])
				else:
					ship1[_sdwig+i]=sship["1"][i]
				ship2[_sdwig+i]=sship["2"][i]
				ship3[_sdwig+i]=sship["3"][i]
			vrag1,vrag2,vrag3=otovr(vs,sdwig)
			for i in range(len(var["Ото"])):
				uvrag[sdwig+i]=var["Ото"][i]
				if yellow(uvrag[sdwig+i]) and not("🂠" in uvrag[sdwig+i]) and not("◊" in uvrag[sdwig+i]) and midl[sdwig+i]==" ":
					midl[sdwig+i]="\033[33m{}\033[0m".format("∷")
					uship[sdwig+i]="\033[33m{}\033[0m".format("∷")
					if ship1[sdwig+i]==" ":
						ship1[sdwig+i]="\033[33m{}\033[0m".format("∷")
						ship2[sdwig+i]="\033[33m{}\033[0m".format("∷")
						ship3[sdwig+i]="\033[33m{}\033[0m".format("∷")
				if red(uvrag[sdwig+i]) and not("!" in uvrag[sdwig+i]) and (midl[sdwig+i]==" " or midl[sdwig+i]=="\033[31m{}\033[0m".format("∷")):
					midl[sdwig+i]="\033[31m{}\033[0m".format("∷")
					uship[sdwig+i]="\033[31m{}\033[0m".format("∷")
					if ship1[sdwig+i]==" ":
						ship1[sdwig+i]="\033[31m{}\033[0m".format("∷")
						ship2[sdwig+i]="\033[31m{}\033[0m".format("∷")
						ship3[sdwig+i]="\033[31m{}\033[0m".format("∷")

			if ha[z%(r+1)].выпуск!=" ":
				for i in range(len(sship["Отсек"])):
					uship[sship["Отсек"][i]+_sdwig]="\033[34m{}\033[0m".format("∷")
					if midl[sship["Отсек"][i]+_sdwig]==" " or  "∷" in midl[sship["Отсек"][i]+_sdwig]:
						midl[sship["Отсек"][i]+_sdwig]="\033[34m{}\033[0m".format("∷")
			if ha[z%(r+1)].урон>-1:
				for i in range(len(uship)):
					_o=False
					if i-_sdwig in sship["Пушка"]:
						uship[i]="\033[34m{}\033[0m".format("∷")
						if midl[i]==" " or  "∷" in midl[i]:
							midl[i]="\033[34m{}\033[0m".format("∷")
							_o=True
					if _o or "⍓" in midl[i]:
							uvrag[i]="\033[34m{}\033[0m".format("∷")
							if vrag3[i]==" ":
								vrag1[i]="\033[34m{}\033[0m".format("∷")
								vrag2[i]="\033[34m{}\033[0m".format("∷")
								vrag3[i]="\033[34m{}\033[0m".format("∷")

			vrag=nam+"\n"+"\033[1m\033[31m{}\033[0m".format("["+hp*"■"+(mhp-hp)*" "+"]           ")+"\033[1m\033[34m{}\033[0m".format("["+bron*"■"+(mbron-bron)*" "+"]  ")
			if vbron>0:
				vrag+="\033[1m\033[35m{}\033[0m".format("["+vdefe*"■"+"]  ")
			for key,v1 in enef.items():
				if v1>0:
					vrag+=" "+str(v1)+key
			vrag+="\n"

			ship="\n"+"\033[1m\033[31m{}\033[0m".format("["+life*"■"+(mlife-life)*" "+"]   ")+"\033[1m\033[34m{}\033[0m".format("["+defe*"■"+(mdefe-defe)*" "+"]  ")
			if vdefe>0:
				ship+="\033[1m\033[35m{}\033[0m".format("["+vdefe*"■"+"]  ")
			if manevr>0:
				ship+=str(manevr)+"<>"
			for key,v1 in ef.items():
				if v1>0:
					ship+=" "+str(v1)+key
			rr=["⓿","❶","❷","❸","❹","❺","❻","❼","❽","❾","❿","⓫","⓬","⓭","⓮","⓯","⓰","⓱","⓲","⓳","⓴"]
			ship+="\n"+rr[ener]

			print("\033[H\033[2J")
			print(vrag)
			print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
			print(ship,"\n")

			for i in range(len(midl)):
				if "∷" in midl[i]:
					midl[i]=" "
					uship[i]=" "
					if "∷" in ship1[i]:
						ship1[i]=" "
						ship2[i]=" "
						ship3[i]=" "


			for i in range(r+1):
				if z%(r+1)==i:
					tt="• "

					if "потеряйте все кристаллы, урон равный их удвоенному количеству" in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=ef["💎"]*2
					if "потеряйте все кристаллы, урон равный их утроенному количеству" in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=ef["💎"]*3
					if "очистить всю руку" in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=ha[z%(r+1)].вщит=r-1
						if "А" in ha[z%(r+1)].имя:
							ha[z%(r+1)].вщит+=r-1
					if "по отсутствующему здоровью" in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=mlife-life
						if "устанавливает здоровье на 0" in ha[z%(r+1)].доп:
							ha[z%(r+1)].урон=mlife-1
					if "равный нагреву," in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=ef["🔥"]+ha[z%(r+1)].статус["🔥"]
					if "🛻 Двигатель внутреннего сгорания" in ha[z%(r+1)].имя:
						ha[z%(r+1)].доп=ha[z%(r+1)].доп.replace("➡️","")
						ha[z%(r+1)].доп=ha[z%(r+1)].доп.replace("⬅️","")
						ha[z%(r+1)].доп="➡️"*(ef["🔥"]+ha[z%(r+1)].статус["🔥"])+ha[z%(r+1)].доп
					if "по общему урону врага" in ha[z%(r+1)].доп:
						ha[z%(r+1)].урон=0
						for qwert in range(0,len(var["Урон"]),2):
							ha[z%(r+1)].урон+=var["Урон"][qwert]
					if ha[z%(r+1)].имя=="🔫 Ручная пушка!":
						ha[z%(r+1)].урон=r-1
					if ha[z%(r+1)].имя=="🔫 Ручная пушка! А":
						ha[z%(r+1)].урон=r
					if ha[z%(r+1)].имя=="🔫 Ручная пушка! Б":
						ha[z%(r+1)].урон=2*(r-1)
					if "▟" in ha[z%(r+1)].доп and ef["💾"]>0:
						ha[z%(r+1)].цена=0
					if ("➡️" in ha[z%(r+1)].доп or "⬅️" in ha[z%(r+1)].доп) and ef["🪑"]>0 and not("🔃" in ha[z%(r+1)].доп):
						ha[z%(r+1)].доп+="🔃"
					ttt=ha[z%(r+1)].show(ef)
				print(tt+str(ha[i])+ttt)
				tt,ttt=" ",""

			a=input()
			if a=="w":
				z-=1
			elif a=="s" or a=="":
				z+=1
			elif a=="c" and "🔃" in ha[z%(r+1)].доп:
				if "➡️" in ha[z%(r+1)].доп:
					ha[z%(r+1)].доп=ha[z%(r+1)].доп.replace("➡️","⬅️")
				elif "⬅️" in ha[z%(r+1)].доп:
					ha[z%(r+1)].доп=ha[z%(r+1)].доп.replace("⬅️","➡️")
			elif a=="a":
				if manevr>0 and sdwig<53 and ef["🛑"]==0:
					sdwig+=1+ef["🥾"]
					manevr-=1
					for qqq in range(1+ef["🥾"]):
						midl.insert(0,midl.pop(-2))
					if ef["✈"]>0:
						vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["✈"],defe,life,var,mhp,mbron,re,pr)
						pr=False
						if "▩ Калибратор оглушения" in re:
							if kalib:
								ef["🕸"]+=1
								kalib=False
						if "⏺ Слинковка" in re:
							slink+=1

			elif a=="d":
				if manevr>0 and sdwig>1 and ef["🛑"]==0:
					sdwig-=1+ef["🥾"]
					for qqq in range(1+ef["🥾"]):
						midl.insert(-2,midl.pop(0))
					manevr-=1

					if ef["✈"]>0:
						vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["✈"],defe,life,var,mhp,mbron,re,pr)
						pr=False
						if "▩ Калибратор оглушения" in re:
							if kalib:
								ef["🕸"]+=1
								kalib=False
						if "⏺ Слинковка" in re:
							slink+=1


			elif a=="dd":
				if ef["<🟢>"]>0:
					ef["<🟢>"]-=1
					midl.insert(0,midl.pop(-2))
			elif a=="aa":
				if ef["<🟢>"]>0:
					ef["<🟢>"]-=1
					midl.insert(-2,midl.pop(0))
			#Карта
			elif (a!="" and (ener>=ha[z%(r+1)].цена or ha[z%(r+1)].имя=="Конец хода")) and (not("Обязан уже сыграть 4 карты в этот ход!" in ha[z%(r+1)].доп) or ("Обязан уже сыграть 4 карты в этот ход!" in ha[z%(r+1)].доп and book>=4)) and (not("Обязан уже сыграть 3 карты в этот ход!" in ha[z%(r+1)].доп) or ("Обязан уже сыграть 3 карты в этот ход!" in ha[z%(r+1)].доп and book>=3)):
				book+=1
				ener-=ha[z%(r+1)].цена
				sgor=False
				if "⚡ Кешбек" in re and ha[z%(r+1)].цена>2:
					ener+=1
				if "♾" in ha[z%(r+1)].доп:
					do=ha[z%(r+1)]
					r+=1
				else:
					do=ha.pop(z%(r+1))
				z=0
				if "Разыграйте самую левую карту бесплатно и истощите её" in do.доп:
					sbros.append(do)
					if ha[0].имя!="Конец хода":
						do=ha.pop(0)
						r-=1
					else:
						do=card()
					sgor=True
				elif "Разыграйте самую левую карту бесплатно" in do.доп:
					sbros.append(do)
					if ha[0].имя!="Конец хода":
						do=ha.pop(0)
						r-=1
					else:
						do=card()
				for qwert in ha:
					if qwert.имя=="🗣 Статический шум":
						sgor=True
						break
				if "потратьте 💎 на добор 1" in do.доп:
					if ef["💎"]>=1:
						ef["Добор"]+=1
						ef["💎"]-=1
				if "потратьте 💎💎 на 3 щита" in do.доп:
					if ef["💎"]>=2:
						defe+=3
				if "потратьте 💎💎💎💎💎 на 2🔶" in do.доп:
					if ef["💎"]>=5 and ef["💍"]>=5:
						ef["💎"]-=5
						ef["🔶"]+=2
				if "потратьте 💎💎💎💎 на 1🔶" in do.доп and not("А" in do.имя):
					if ef["💎"]>=4 and ef["💍"]>=4:
						ef["💎"]-=4
						ef["🔶"]+=1
				if "Если 💎>1, то потратьте 💎💎 на урон 1" in do.доп:
					if ef["💎"]>1:
						if ef["💎"]>=2:
							ef["💎"]-=2
							do.урон=1
				if "Если 💎>1, то потратьте 💎💎 на урон 2" in do.доп:
					if ef["💎"]>1:
						if ef["💎"]>=2:
							ef["💎"]-=2
							do.урон=2
				if "потратьте 💎💎 за +2 ХП" in do.доп:
					if ef["💎"]>=2:
						ef["💎"]-=2
						life+=2
						if "🩹 Усилитель лечения" in re:
							life+=1
				if "потратьте 💎💎 за +1 ХП" in do.доп:
					if ef["💎"]>=2:
						ef["💎"]-=2
						life+=1
						if "🩹 Усилитель лечения" in re:
							life+=1
				if "потратьте 💎 за +1 ХП" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						life+=1
						if "🩹 Усилитель лечения" in re:
							life+=1
				if "забирает объект в ракетный отсек" in do.доп and midl[_sdwig+sship["Отсек"][0]]!=" ":
					exo=recolor(midl[_sdwig+sship["Отсек"][0]])
					midl[_sdwig+sship["Отсек"][0]]=" "
					if "ᐁ" in exo:
						exo="∆"
					if "▼" in exo:
						exo="▲"
					if "⟰" in exo:
						exo="⟱"
					if "⸔" in exo:
						exo="⸕"
					if "⇘" in exo:
						exo="⇖"
					if "⬇" in exo:
						exo="⬆"
					if "⤈" in exo:
						exo="⤉"
					r+=1
					ha.insert(-2,card(перс="Академия",имя="Отдарок",цена=0,выпуск=exo,доп="🧲  ▟"))
				if "Вытяните все бесплатные карты из сброса" in do.доп:
					for qwert in range(len(sbros)):
						if sbros[qwert].цена==0:
							r+=1
							ha.insert(-2,sbros.pop(qwert))
							qwert-=1
				if "Поместите три осколка в сброс" in do.доп:
					sbros.extend([card(перс="Академия",имя="💎 Осколок",цена=0,статус={"💎":1,"Добор":1})]*3)
				if "Поместите два осколка в добор" in do.доп:
					vta.extend([card(перс="Академия",имя="💎 Осколок",цена=0,статус={"💎":1,"Добор":1})]*2)
				if "Поместите осколок в добор" in do.доп:
					vta.extend([card(перс="Академия",имя="💎 Осколок",цена=0,статус={"💎":1,"Добор":1})])
				if "добавьте в руку осколок" in do.доп:
					r+=1
					ha.insert(-2,card(перс="Академия",имя="💎 Осколок",цена=0,статус={"💎":1,"Добор":1}))
				if "потратьте 💎💎💎 на +1 энерг." in do.доп:
					if ef["💎"]>=3:
						ef["💎"]-=3
						ener+=1
				if "потратьте 💎💎 на +1 энерг." in do.доп:
					if ef["💎"]>=2:
						ef["💎"]-=2
						ener+=1
				if "Горюново поле" in do.имя:
					for qwert in range(len(midl)-1):
						if midl[qwert]!=" ":
							midl[qwert]="☄"
				if "устанавливает здоровье на 0" in do.доп:
					life=1
				if "потратьте 💎 на 1 щит  потратьте 💎 на 1 щит" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						defe+=1
					if ef["💎"]>=1:
						ef["💎"]-=1
						defe+=1
				if "потратьте 💎 на 2 щита" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						defe+=2
				if "потратьте 💎 на выпуск ☄" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						do.выпуск="☄"
					else:
						do.выпуск=" "
				if "потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
				elif "потратьте 💎 на 1 манёвр  потратьте 💎 на 1 манёвр" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
				elif "потратьте 💎 на 1 манёвр " in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						manevr+=1
				if "потратьте 💎 на +2💎" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]+=1
				if "потратьте 💎 на +3💎" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]+=2
				if "потратьте 💎 на урон 2" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						do.урон=2
					else:
						do.урон=-1
				if "потратьте 💎 на урон 3" in do.доп:
					if ef["💎"]>=1:
						ef["💎"]-=1
						do.урон=3
					else:
						do.урон=-1
				if "статический шум в руку" in do.доп:
					ha.insert(-2,card(имя="🗣 Статический шум",доп="пока эта карта в руке все карты истощаются  ▟"))
					r+=1
				if "статический шум в добор" in do.доп:
					vta.append(card(имя="🗣 Статический шум",доп="пока эта карта в руке все карты истощаются  ▟"))
				if "верните истощённую карту в руку" in do.доп and len(burn)>0:
					exo=vv("Выберете карту для перемещения",burn,len(burn),"")
					ha.insert(-2,exo)
					burn.remove(exo)
					r+=1
				if "верните две истощённые карты в руку" in do.доп and len(burn)>0:
					exo=vv("Выберете карту для перемещения",burn,len(burn),"")
					ha.insert(-2,exo)
					burn.remove(exo)
					exo=vv("Выберете карту для перемещения",burn,len(burn),"")
					ha.insert(-2,exo)
					burn.remove(exo)
					r+=2
				if "🫱" in do.доп:
					exo=ha.pop(-1)
					random.shuffle(ha)
					ha.append(exo)
				if "потеряйте все кристаллы" in do.доп:
					ef["💎"]=0
				if "две самых правых карты получают магнит" in do.доп:
					ha[-2].доп+="  🧲"
					ha[-3].доп+="  🧲"
				if "самая правая карта получает магнит" in do.доп:
					ha[-2].доп+="  🧲"
				if "добавьте червя в сброс" in do.доп:
					sbros.append(card(перс="Макс",имя="🪱 Червь",вщит=2,доп="добавьте червя в сброс  🧲"))
				if "добавьте червя А в руку" in do.доп:
					ha.insert(-2,card(перс="Макс",имя="🪱 Червь А",вщит=2,доп="добавьте червя А в руку  🧲"))
					r+=1
				if "добавьте червя Б в сброс" in do.доп:
					sbros.append(card(перс="Макс",цена=0,имя="🪱 Червь Б",щит=1,доп="добавьте червя Б в сброс"))
				if "создайте копию выбранной карты" in do.доп:
					exo=vv("Выберете карту для копирования:",ha,len(ha)-1,"")
					ha.insert(-2,exo)
					r+=1
				if "создайте копию левой карты" in do.доп:
					r+=1
					ha.insert(-2,ha[0])
				if "Сохрани координаты врага" in do.доп:
					ha.insert(-2,card(перс="Макс",имя="⛰️ Загрузить позицию",доп="Загрузи координаты врага  🧲  ▟"))
					r+=1
					save_s=sdwig
				if "очистить всю руку" in do.доп:
					while len(ha)>1:
						r-=1
						burn.append(ha.pop(0))
				if "Загрузи координаты врага" in do.доп:
					sdwig=save_s
				if do.имя=="🩸 Токсик":
					ef["🩸"]-=1
				if "даёт 3 гальки А" in do.доп:
					r+=3
					ha.insert(-2,card(перс="Айзек",имя="Галька А",выпуск="\033[1m\033[34m{}\033[0m".format("о"),цена=0,доп="▟"))
					ha.insert(-2,card(перс="Айзек",имя="Галька А",выпуск="\033[1m\033[34m{}\033[0m".format("о"),цена=0,доп="▟"))
					ha.insert(-2,card(перс="Айзек",имя="Галька А",выпуск="\033[1m\033[34m{}\033[0m".format("о"),цена=0,доп="▟"))
				elif "даёт 3 гальки" in do.доп:
					r+=3
					ha.insert(-2,card(перс="Айзек",имя="Галька",выпуск="о",цена=0,доп="▟"))
					ha.insert(-2,card(перс="Айзек",имя="Галька",выпуск="о",цена=0,доп="▟"))
					ha.insert(-2,card(перс="Айзек",имя="Галька",выпуск="о",цена=0,доп="▟"))
				if "+2🟥" in do.доп:
					life+=2
					if "🩹 Усилитель лечения" in re:
						life+=1
				if "+1🟥" in do.доп:
					life+=1
					if "🩹 Усилитель лечения" in re:
						life+=1
				if "Все объекты среднего ряда покрываются пузырями" in do.доп:
					for gar in range(len(midl)-1):
						if midl[gar]!=" " and not(blue(midl[gar])):
							midl[gar]="\033[1m\033[34m{}\033[0m".format(midl[gar])
				for gar in range(do.доп.count("<🟩")):
					midl.insert(-2,midl.pop(-0))
				for gar in range(do.доп.count("🟩>")):
					midl.insert(0,midl.pop(-2))
				if "-1🟥" in do.доп:
					life-=1
				if "-3🔥" in do.доп:
					ef["🔥"]-=3
					if ef["🔥"]<0:
						ef["🔥"]=0
				if "-1🔥" in do.доп:
					ef["🔥"]-=1
					if ef["🔥"]<0:
						ef["🔥"]=0
				if "🕸" in do.доп:
					ef["🕸"]+=1
				if "+1 мах🟦" in do.доп:
					mdefe+=1
				if "+2 мах🟦" in do.доп:
					mdefe+=2
				if "-1 мах🟦" in do.доп:
					mdefe-=1
				if "-2 мах🟦" in do.доп:
					mdefe-=2
				if "+1 энергии" in do.доп:
					ener+=1
				if "+2 энергии" in do.доп:
					ener+=2
				if "+3 энергии" in do.доп:
					ener+=3
				if "Сбросьте руку" in do.доп:
					while ha[0].имя!="Конец хода":
						sbros.extend([ha.pop(0)])
					r=1
				if "+3 '🌫 дым' в добор" in do.доп:
					vta.extend([card(имя="🌫 дым",цена=0,доп="▟")]*3)
				if "+2 '🌫 дым' в добор" in do.доп:
					vta.extend([card(имя="🌫 дым",цена=0,доп="▟")]*2)
				if "Х=🟦  ♦+=Х  🟦=0" in do.доп:
					X=defe
					ef["♦"]+=X
					defe=0
				if "Х=🟦  ♦+=Х  🟦=2" in do.доп:
					X=defe
					ef["♦"]+=X
					defe=2
				if "Х=🟦    <>+=Х    🟦=0" in do.доп:
					X=defe
					manevr+=X
					defe=0
				elif "Х=🟦    <>+=Х" in do.доп:
					X=defe
					manevr+=X
				if (do.имя=="Эхо Эхо Эхо" or do.имя=="Эхо Эхо Эхо А") and len(sbros)>0:
					exo=vv("Выберете карту для перемещения",sbros,len(sbros),"")
					sbros.remove(exo)
					vta.append(exo)
				if do.имя=="Эхо Эхо Эхо Б" and len(sbros)>0:
					exo=vv("Выберете карту для перемещения",sbros,len(sbros),"")
					sbros.remove(exo)
					ha.insert(-2,exo)
					r+=1
				if do.имя=="💡 Выборочная память" and len(vta)>0:
					exo=vv("Выберете карту для перемещения",vta,len(vta),"")
					vta.remove(exo)
					ha.insert(-2,exo)
					r+=1
				if do.имя=="💡 Выборочная память А":
					exo=vv("Выберете карту для перемещения",vta,len(vta),"")
					vta.remove(exo)
					ha.insert(-2,exo)
					exo=vv("Выберете карту для перемещения",vta,len(vta),"")
					vta.remove(exo)
					ha.insert(-2,exo)
					r+=2
				if do.имя=="💡 Выборочная память Б":
					vta.extend(sbros)
					sbros=[]
					exo=vv("Выберете карту для перемещения",vta,len(vta),"")
					vta.remove(exo)
					ha.insert(-2,exo)
					r+=1
				if "Добавляет '🌊 Волновой бум' в руку" in do.доп:
					ha.insert(-2,card(перс="Пери",имя="🌊 Волновой бум",цена=0,урон=2,доп="пробивает"))
					r+=1
				if "Добавляет два '🌊 Волновой бум' в руку" in do.доп:
					ha.insert(-2,card(перс="Пери",имя="🌊 Волновой бум",цена=0,урон=2,доп="пробивает"))
					ha.insert(-2,card(перс="Пери",имя="🌊 Волновой бум",цена=0,урон=2,доп="пробивает"))
					r+=2
				if "👻▟" in do.доп:
					for q1 in range(len(coloda)):
						if cards(coloda[q1]).имя==do.имя:
							coloda.pop(q1)
							break
				if "Все дроны и ракеты срабатывают" in do.доп:
					for i in range(len(midl)):
						if "∆" in midl[i] or "⇅" in midl[i]:
							попал=False
							if enef["↩"]>0 and vrag3[i]!=" ":
								ef["↩"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							if enef["↪"]>0 and vrag3[i]!=" ":
								ef["↪"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uvrag[i]="\033[1m\033[31m{}\033[0m".format("|")
							if vrag3[i]==" ":
								vrag1[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=1-1
								elif ii in vs["Уязвимость"]:
									vbron-=1+1
								elif ii in vs["Трещина"]:
									vbron-=2*(1)
								else:
									vbron-=1
								попал=True
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "
							if попал:
								if enef["⊥"]>0 or enef["⇫"]>0:
									if ef["↩"]>0:
										ef["↩"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig+=1
											midl.insert(0,midl.pop(-2))
									if ef["↪"]>0:
										ef["↪"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig-=1
											midl.insert(-2,midl.pop(0))
									vrag1,vrag2,vrag3=otovr(vs,sdwig)
									kord=vs["Пушка"][0]+sdwig
									uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
									if midl[kord]==" ":
										midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
										uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
										if ship1[kord]==" ":
											ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
										else:
											ii=kord-_sdwig
											if ii in sship["Броня"]:
												vdefe-=enef["⇫"]+enef["⊥"]-1
											elif ii in sship["Уязвимость"]:
												vdefe-=enef["⇫"]+enef["⊥"]+1
											elif ii in sship["Трещина"]:
												vdefe-=2*(enef["⇫"]+enef["⊥"])
											else:
												vdefe-=enef["⇫"]+enef["⊥"]
											if vdefe<0:
												defe+=vdefe
												vdefe=0
												if defe<0 and ef["🥇"]==0:
													life+=defe
													defe=0
									else:
										if blue(midl[kord]):
											midl[kord]=recolor(midl[kord])
										else:
											midl[kord]="💥"
									print("\033[H\033[2J")
									print(vrag)
									print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
									print(ship,"\n")
									sleep(0.2)
									uvrag[kord]=" "
									if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										midl[kord]=" "
									if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										uship[kord]=" "
									if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										ship3[kord]=" "
										ship2[kord]=" "
										ship1[kord]=" "

						if "ᐁ" in midl[i] or "⇅" in midl[i]:
							попал=False
							if ef["↩"]>0 and ship1[i]!=" ":
								ef["↩"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1

							if enef["↪"]>0 and ship1[i]!=" ":
								ef["↪"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uship[i]="\033[1m\033[31m{}\033[0m".format("|")
							if ship1[i]==" ":
								ship1[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=1-1
								elif ii in sship["Уязвимость"]:
									vdefe-=1+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(1)
								else:
									vdefe-=1
								попал=True
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

						if "▲" in midl[i]:
							попал=False
							if enef["↩"]>0 and vrag3[i]!=" ":
								ef["↩"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							if enef["↪"]>0 and vrag3[i]!=" ":
								ef["↪"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uvrag[i]="\033[1m\033[31m{}\033[0m".format("|")
							if vrag3[i]==" ":
								vrag1[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=2-1
								elif ii in vs["Уязвимость"]:
									vbron-=2+1
								elif ii in vs["Трещина"]:
									vbron-=2*(2)
								else:
									vbron-=2
								попал=True
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "
							if попал:
								if enef["⊥"]>0 or enef["⇫"]>0:
									if ef["↩"]>0:
										ef["↩"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig+=1
											midl.insert(0,midl.pop(-2))
									if ef["↪"]>0:
										ef["↪"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig-=1
											midl.insert(-2,midl.pop(0))
									vrag1,vrag2,vrag3=otovr(vs,sdwig)
									kord=vs["Пушка"][0]+sdwig
									uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
									if midl[kord]==" ":
										midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
										uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
										if ship1[kord]==" ":
											ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
										else:
											ii=kord-_sdwig
											if ii in sship["Броня"]:
												vdefe-=enef["⇫"]+enef["⊥"]-1
											elif ii in sship["Уязвимость"]:
												vdefe-=enef["⇫"]+enef["⊥"]+1
											elif ii in sship["Трещина"]:
												vdefe-=2*(enef["⇫"]+enef["⊥"])
											else:
												vdefe-=enef["⇫"]+enef["⊥"]
											if vdefe<0:
												defe+=vdefe
												vdefe=0
												if defe<0 and ef["🥇"]==0:
													life+=defe
													defe=0
									else:
										if blue(midl[kord]):
											midl[kord]=recolor(midl[kord])
										else:
											midl[kord]="💥"
									print("\033[H\033[2J")
									print(vrag)
									print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
									print(ship,"\n")
									sleep(0.2)
									uvrag[kord]=" "
									if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										midl[kord]=" "
									if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										uship[kord]=" "
									if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										ship3[kord]=" "
										ship2[kord]=" "
										ship1[kord]=" "

						elif "▼" in midl[i]:
							попал=False
							if ef["↩"]>0 and ship1[i]!=" ":
								ef["↩"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1

							if enef["↪"]>0 and ship1[i]!=" ":
								ef["↪"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uship[i]="\033[1m\033[31m{}\033[0m".format("|")
							if ship1[i]==" ":
								ship1[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=2-1
								elif ii in sship["Уязвимость"]:
									vdefe-=2+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(2)
								else:
									vdefe-=2
								попал=True
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

						if "⟱" in midl[i]:
							uship[i]="\033[1m\033[34m{}\033[0m".format("|")
							if i-_sdwig in sship["Твёрд"]:
								defe+=1
							else:
								ship1[i]="\033[1m\033[34m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[34m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[34m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "

						if "⟰" in midl[i]:
							uvrag[i]="\033[1m\033[34m{}\033[0m".format("|")
							if i-sdwig in vs["Твёрд"]:
								bron+=1
							else:
								vrag1[i]="\033[1m\033[34m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[34m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[34m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "

						if "⥮" in midl[i]:
							uship[i]="\033[1m\033[33m{}\033[0m".format("|")
							if i-_sdwig in sship["Твёрд"]:
								ef["⚡"]+=1
							else:
								ship1[i]="\033[1m\033[33m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[33m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[33m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[33m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[33m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "

						if "⬆" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag[i]=" "
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=2-1
								elif ii in vs["Уязвимость"]:
									vbron-=2+1
								elif ii in vs["Трещина"]:
									vbron-=2*(2)
								else:
									vbron-=2
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⬇" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=2-1
								elif ii in sship["Уязвимость"]:
									vdefe-=2+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(2)
								else:
									vdefe-=2
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⤉" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag[i]=" "
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=3-1
								elif ii in vs["Уязвимость"]:
									vbron-=3+1
								elif ii in vs["Трещина"]:
									vbron-=2*(3)
								else:
									vbron-=3
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⤈" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=3-1
								elif ii in sship["Уязвимость"]:
									vdefe-=3+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(3)
								else:
									vdefe-=3
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⸕" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag=" "
								enef["🩸"]+=1
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⸔" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ef["🩸"]+=1
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⇖" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]==" ":
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								while not(i-sdwig in vs["Твёрд"]):
									if i<=sdwig:
										i+=1
										vrag3[i]=vrag3[i-1]
										vrag3[i-1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
									if i>sdwig:
										i-=1
										vrag3[i]=vrag3[i+1]
										vrag3[i+1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
							ii=i-sdwig
							if ii in vs["Броня"]:
								vbron-=2-1
							elif ii in vs["Уязвимость"]:
								vbron-=2+1
							elif ii in vs["Трещина"]:
								vbron-=2*(2)
							else:
								vbron-=2
							if vbron<0:
								bron+=vbron
								vbron=0
								if bron<0 and enef["🥇"]==0:
									hp+=bron
									bron=0

						if "⇘" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship3[i]==" ":
								ship3[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								k=58
								if "🧭 Излучатели дипольных отражателей" in re:
									diapol=2
								while not(i-_sdwig in sship["Твёрд"]) and diapol>0:
									diapol+=1
									if i<=_sdwig:
										i+=1
										ship3[i]=ship3[i-1]
										ship3[i-1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
									if i>_sdwig:
										i-=1
										ship3[i]=ship3[i+1]
										ship3[i+1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
							ii=i-_sdwig
							if ii in sship["Броня"]:
								vdefe-=2-1
							elif ii in sship["Уязвимость"]:
								vdefe-=2+1
							elif ii in sship["Трещина"]:
								vdefe-=2*(2)
							else:
								vdefe-=2
							if vdefe<0:
								defe+=vdefe
								vdefe=0
								if defe<0 and enef["🥇"]==0:
									life+=defe
									defe=0

				if "+4🟥" in do.доп:
					life+=4
					if "🩹 Усилитель лечения" in re:
						life+=1
				if do.урон>-1:
					if "пробивает" in do.доп:
						pr=True
					if "☢" in do.имя:
						sohr=vbron+bron+hp
					vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,do.урон,defe,life,var,mhp,mbron,re,pr)
					if "уязвимость на место попадания" in do.доп:
						for jjj in sship["Пушка"]:
							vs["Уязвимость"].append(jjj+_sdwig-sdwig)
					if "трещина на место попадания" in do.доп:
						for jjj in sship["Пушка"]:
							vs["Трещина"].append(jjj+_sdwig-sdwig)
					if "броня на место попадания" in do.доп:
						for jjj in sship["Пушка"]:
							vs["Броня"].append(jjj+_sdwig-sdwig)
					if "☢" in do.имя:
						if vbron+bron+hp>=sohr:
							enef["🩸"]-=1
					pr=False
					if "▩ Калибратор оглушения" in re:
						if kalib:
							ef["🕸"]+=1
							kalib=False
					if "⏺ Слинковка" in re:
						slink+=1
				if do.щит>0:
					defe+=do.щит
					if defe>mdefe:
						defe=mdefe
				if do.доп=="+1 за каждый сыгранный раз":
					do.щит+=1
				if do.доп=="+2 за каждый сыгранный раз":
					do.щит+=2
				for key, v in do.встатус.items():
					if v>0:
						enef[key]+=v
				for key, v in do.статус.items():
					if v>0:
						if key=="🔥" and ef["😇"]>0:
							ef["😇"]-=1
						else:
							ef[key]+=v+ef["🌈"]
							if ef["🌈"]>0 and key!="🌈":
								ef["🌈"]=0
				if do.манёвр>0:
					manevr+=do.манёвр
				qwert=0
				if "↔️" in do.доп and ef["🛑"]==0:
					qwert=random.choice([1,2])
				if ("➡️" in do.доп and ef["🛑"]==0) or qwert==1:
					sdwig-=do.доп.count("➡️")+do.доп.count("↔️")
					for i in range(do.доп.count("➡️")):
						midl.insert(-2,midl.pop(0))
				if ("⬅️" in do.доп and ef["🛑"]==0) or qwert==2:
					sdwig+=do.доп.count("⬅️")+do.доп.count("↔️")
					for i in range(do.доп.count("⬅️")):
						midl.insert(0,midl.pop(-2))
				if do.вщит>0:
					vdefe+=do.вщит
				if "Х=🟦    🖍=Х" in do.доп:
					vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,defe,defe,life,var,mhp,mbron,re,pr)
					pr=False
					if "▩ Калибратор оглушения" in re:
						if kalib:
							ef["🕸"]+=1
							kalib=False
					if "⏺ Слинковка" in re:
						slink+=1

				for pppp in range(do.доп.count("повторить")):
					if do.урон>-1:
						vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,do.урон,defe,life,var,mhp,mbron,re,pr)
						pr=False
						if "▩ Калибратор оглушения" in re:
							if kalib:
								ef["🕸"]+=1
								kalib=False
						if "⏺ Слинковка" in re:
							slink+=1

				if do.выпуск!=" ":
					do.выпуск=do.выпуск.split(" ")
					uvrag=[" "]*55+["\n"]
					for w in range(len(do.выпуск)):
						if ef["🚀"]>0:
							if "∆" in do.выпуск[w]:
								vup="ᐁ"
							if "▲" in do.выпуск[w]:
								vup="▼"
							if "⟱" in do.выпуск[w]:
								vup="⟰"
							if "⸕" in do.выпуск[w]:
								vup="⸔"
							if "⇖" in do.выпуск[w]:
								vup="⇘"
							if "⬆" in do.выпуск[w]:
								vup="⬇"
							if "⤉" in do.выпуск[w]:
								vup="⤈"
						else:
							vup=do.выпуск[w][-1]
						sw=0
						if len(do.выпуск[w])>1:
							if do.выпуск[w][1]=="<":
								sw-=int(do.выпуск[w][0])
							if do.выпуск[w][1]==">":
								sw+=int(do.выпуск[w][0])
						if ef["🫧"]==0:
							uship[sship["Отсек"][0]+_sdwig+sw]=vup
						else:
							uship[sship["Отсек"][0]+_sdwig+sw]="\033[1m\033[34m{}\033[0m".format(vup)
						print("\033[H\033[2J")
						print(vrag)
						print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
						print(ship,"\n")
						sleep(0.2)
						uship[sship["Отсек"][0]+_sdwig+sw]=" "
						if midl[sship["Отсек"][0]+_sdwig+sw]==" ":
							if ef["🫧"]==0:
								midl[sship["Отсек"][0]+_sdwig+sw]=vup
							else:
								midl[sship["Отсек"][0]+_sdwig+sw]="\033[1m\033[34m{}\033[0m".format(vup)
						else:
							if blue(midl[sship["Отсек"][0]+_sdwig+sw]):
								midl[sship["Отсек"][0]+_sdwig+sw]=recolor(midl[sship["Отсек"][0]+_sdwig+sw])
							else:
								midl[sship["Отсек"][0]+_sdwig+sw]="💥"
						print("\033[H\033[2J")
						print(vrag)
						print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
						print(ship,"\n")
						sleep(0.2)
						if midl[sship["Отсек"][0]+_sdwig+sw]=="💥":
							midl[sship["Отсек"][0]+_sdwig+sw]=" "
						if ef["🫧"]>0:
							ef["🫧"]-=1
					do.выпуск=" ".join(do.выпуск)

				if ef["🚘"]!=0 and z%(r+1)==0 and ef["🛑"]==0:
					sdwig+=ef["🚘"]
				if ef["🚘"]!=0 and z%(r+1)==r-1 and ef["🛑"]==0:
					sdwig-=ef["🚘"]
				if (ef["🚘"]!=0 and z%(r+1)==r-1 and ef["🛑"]==0) or (ef["🚘"]!=0 and z%(r+1)==0 and ef["🛑"]==0):
					uvrag=[" "]*55+["\n"]
					for qqq in range(1+ef["🥾"]):
						midl.insert(0,midl.pop(-2))
					if ef["✈"]>0:
						vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["✈"],defe,life,var,mhp,mbron,re,pr)
						pr=False
						if "▩ Калибратор оглушения" in re:
							if kalib:
								ef["🕸"]+=1
								kalib=False
						if "⏺ Слинковка" in re:
							slink+=1
				if "потратьте 💎💎💎💎 на 1🔶" in do.доп and "А" in do.имя:
					if ef["💎"]>=4 and ef["💍"]>=4:
						ef["💎"]-=4
						ef["🔶"]+=1
				if "если убивает, то +2 🟥" in do.доп:
					if hp<0:
						life+=2
						if "🩹 Усилитель лечения" in re:
							life+=1
				#Конец хода
				if do.имя=="Конец хода" or "Чёрный передел" in do.имя:
					if len(ha)>0:
						if ha[-1].имя=="Конец хода":
							ha.pop(-1)
					if "⚛ Ионный преобразователь" in re and ener>0 and defe<mdefe:
						defe+=1

					for i in range(len(midl)):
						if "∆" in midl[i] or "⇅" in midl[i]:
							попал=False
							if enef["↩"]>0 and vrag3[i]!=" ":
								ef["↩"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							if enef["↪"]>0 and vrag3[i]!=" ":
								ef["↪"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uvrag[i]="\033[1m\033[31m{}\033[0m".format("|")
							if vrag3[i]==" ":
								vrag1[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=1-1
								elif ii in vs["Уязвимость"]:
									vbron-=1+1
								elif ii in vs["Трещина"]:
									vbron-=2*(1)
								else:
									vbron-=1
								попал=True
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "
							if попал:
								if enef["⊥"]>0 or enef["⇫"]>0:
									if ef["↩"]>0:
										ef["↩"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig+=1
											midl.insert(0,midl.pop(-2))
									if ef["↪"]>0:
										ef["↪"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig-=1
											midl.insert(-2,midl.pop(0))
									vrag1,vrag2,vrag3=otovr(vs,sdwig)
									kord=vs["Пушка"][0]+sdwig
									uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
									if midl[kord]==" ":
										midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
										uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
										if ship1[kord]==" ":
											ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
										else:
											ii=kord-_sdwig
											if ii in sship["Броня"]:
												vdefe-=enef["⇫"]+enef["⊥"]-1
											elif ii in sship["Уязвимость"]:
												vdefe-=enef["⇫"]+enef["⊥"]+1
											elif ii in sship["Трещина"]:
												vdefe-=2*(enef["⇫"]+enef["⊥"])
											else:
												vdefe-=enef["⇫"]+enef["⊥"]
											if vdefe<0:
												defe+=vdefe
												vdefe=0
												if defe<0 and ef["🥇"]==0:
													life+=defe
													defe=0
									else:
										if blue(midl[kord]):
											midl[kord]=recolor(midl[kord])
										else:
											midl[kord]="💥"
									print("\033[H\033[2J")
									print(vrag)
									print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
									print(ship,"\n")
									sleep(0.2)
									uvrag[kord]=" "
									if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										midl[kord]=" "
									if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										uship[kord]=" "
									if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										ship3[kord]=" "
										ship2[kord]=" "
										ship1[kord]=" "

						if "ᐁ" in midl[i] or "⇅" in midl[i]:
							попал=False
							if ef["↩"]>0 and ship1[i]!=" ":
								ef["↩"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1

							if enef["↪"]>0 and ship1[i]!=" ":
								ef["↪"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uship[i]="\033[1m\033[31m{}\033[0m".format("|")
							if ship1[i]==" ":
								ship1[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=1-1
								elif ii in sship["Уязвимость"]:
									vdefe-=1+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(1)
								else:
									vdefe-=1
								попал=True
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

						if "▲" in midl[i]:
							попал=False
							if enef["↩"]>0 and vrag3[i]!=" ":
								ef["↩"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							if enef["↪"]>0 and vrag3[i]!=" ":
								ef["↪"]-=1
								while i-sdwig in vs["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uvrag[i]="\033[1m\033[31m{}\033[0m".format("|")
							if vrag3[i]==" ":
								vrag1[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[31m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=2-1
								elif ii in vs["Уязвимость"]:
									vbron-=2+1
								elif ii in vs["Трещина"]:
									vbron-=2*(2)
								else:
									vbron-=2
								попал=True
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "
							if попал:
								if enef["⊥"]>0 or enef["⇫"]>0:
									if ef["↩"]>0:
										ef["↩"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig+=1
											midl.insert(0,midl.pop(-2))
									if ef["↪"]>0:
										ef["↪"]-=1
										while ship1[vs["Пушка"][0]+sdwig]!=" ":
											sdwig-=1
											midl.insert(-2,midl.pop(0))
									vrag1,vrag2,vrag3=otovr(vs,sdwig)
									kord=vs["Пушка"][0]+sdwig
									uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
									if midl[kord]==" ":
										midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
										uship[kord]="\033[1m\033[31m{}\033[0m".format("|")
										if ship1[kord]==" ":
											ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
											ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
										else:
											ii=kord-_sdwig
											if ii in sship["Броня"]:
												vdefe-=enef["⇫"]+enef["⊥"]-1
											elif ii in sship["Уязвимость"]:
												vdefe-=enef["⇫"]+enef["⊥"]+1
											elif ii in sship["Трещина"]:
												vdefe-=2*(enef["⇫"]+enef["⊥"])
											else:
												vdefe-=enef["⇫"]+enef["⊥"]
											if vdefe<0:
												defe+=vdefe
												vdefe=0
												if defe<0 and ef["🥇"]==0:
													life+=defe
													defe=0
									else:
										if blue(midl[kord]):
											midl[kord]=recolor(midl[kord])
										else:
											midl[kord]="💥"
									print("\033[H\033[2J")
									print(vrag)
									print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
									print(ship,"\n")
									sleep(0.2)
									uvrag[kord]=" "
									if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										midl[kord]=" "
									if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										uship[kord]=" "
									if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
										ship3[kord]=" "
										ship2[kord]=" "
										ship1[kord]=" "

						elif "▼" in midl[i]:
							попал=False
							if ef["↩"]>0 and ship1[i]!=" ":
								ef["↩"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig+=1
									midl.insert(0,midl.pop(-2))
									i+=1

							if enef["↪"]>0 and ship1[i]!=" ":
								ef["↪"]-=1
								while i-_sdwig in sship["Твёрд"]:
									sdwig-=1
									midl.insert(-2,midl.pop(0))
									i-=1
							uvrag=[" "]*55+["\n"]
							vrag1,vrag2,vrag3=otovr(vs,sdwig)
							uship[i]="\033[1m\033[31m{}\033[0m".format("|")
							if ship1[i]==" ":
								ship1[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[31m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[31m{}\033[0m".format("|")
							else:
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=2-1
								elif ii in sship["Уязвимость"]:
									vdefe-=2+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(2)
								else:
									vdefe-=2
								попал=True
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,defe,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

						if "⟱" in midl[i]:
							uship[i]="\033[1m\033[34m{}\033[0m".format("|")
							if i-_sdwig in sship["Твёрд"]:
								defe+=1
							else:
								ship1[i]="\033[1m\033[34m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[34m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[34m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "

						if "⟰" in midl[i]:
							uvrag[i]="\033[1m\033[34m{}\033[0m".format("|")
							if i-sdwig in vs["Твёрд"]:
								bron+=1
							else:
								vrag1[i]="\033[1m\033[34m{}\033[0m".format("|")
								vrag2[i]="\033[1m\033[34m{}\033[0m".format("|")
								vrag3[i]="\033[1m\033[34m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uvrag[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								uvrag[i]=" "
							if vrag1[i]=="\033[1m\033[34m{}\033[0m".format("|"):
								vrag1[i]=" "
								vrag2[i]=" "
								vrag3[i]=" "

						if "⥮" in midl[i]:
							uship[i]="\033[1m\033[33m{}\033[0m".format("|")
							if i-_sdwig in sship["Твёрд"]:
								ef["⚡"]+=1
							else:
								ship1[i]="\033[1m\033[33m{}\033[0m".format("|")
								ship2[i]="\033[1m\033[33m{}\033[0m".format("|")
								ship3[i]="\033[1m\033[33m{}\033[0m".format("|")
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if uship[i]=="\033[1m\033[33m{}\033[0m".format("|"):
								uship[i]=" "
							if ship1[i]=="\033[1m\033[33m{}\033[0m".format("|"):
								ship1[i]=" "
								ship2[i]=" "
								ship3[i]=" "

						if "⬆" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag[i]=" "
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=2-1
								elif ii in vs["Уязвимость"]:
									vbron-=2+1
								elif ii in vs["Трещина"]:
									vbron-=2*(2)
								else:
									vbron-=2
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⬇" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=2-1
								elif ii in sship["Уязвимость"]:
									vdefe-=2+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(2)
								else:
									vdefe-=2
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⤉" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag[i]=" "
								ii=i-sdwig
								if ii in vs["Броня"]:
									vbron-=3-1
								elif ii in vs["Уязвимость"]:
									vbron-=3+1
								elif ii in vs["Трещина"]:
									vbron-=2*(3)
								else:
									vbron-=3
								if vbron<0:
									bron+=vbron
									vbron=0
									if bron<0 and enef["🥇"]==0:
										hp+=bron
										bron=0
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⤈" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ii=i-_sdwig
								if ii in sship["Броня"]:
									vdefe-=3-1
								elif ii in sship["Уязвимость"]:
									vdefe-=3+1
								elif ii in sship["Трещина"]:
									vdefe-=2*(3)
								else:
									vdefe-=3
								if vdefe<0:
									defe+=vdefe
									vdefe=0
									if defe<0 and ef["🥇"]==0:
										life+=defe
										defe=0
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⸕" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]!=" ":
								uvrag=" "
								enef["🩸"]+=1
							else:
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag2[i]=vrag3[i]
								vrag3[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=vrag2[i]
								vrag2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								vrag1[i]=" "

						if "⸔" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship1[i]!=" ":
								uship[i]=" "
								ef["🩸"]+=1
							else:
								ship1[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship2[i]=ship1[i]
								ship1[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=ship2[i]
								ship2[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								ship3[i]=" "

						if "⇖" in midl[i]:
							uvrag[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if vrag3[i]==" ":
								vrag3[i]=uvrag[i]
								uvrag[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								while not(i-sdwig in vs["Твёрд"]):
									if i<=sdwig:
										i+=1
										vrag3[i]=vrag3[i-1]
										vrag3[i-1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
									if i>sdwig:
										i-=1
										vrag3[i]=vrag3[i+1]
										vrag3[i+1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
							ii=i-sdwig
							if ii in vs["Броня"]:
								vbron-=2-1
							elif ii in vs["Уязвимость"]:
								vbron-=2+1
							elif ii in vs["Трещина"]:
								vbron-=2*(2)
							else:
								vbron-=2
							if vbron<0:
								bron+=vbron
								vbron=0
								if bron<0 and enef["🥇"]==0:
									hp+=bron
									bron=0

						if "⇘" in midl[i]:
							uship[i]=midl[i]
							midl[i]=" "
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if ship3[i]==" ":
								ship3[i]=uship[i]
								uship[i]=" "
								print("\033[H\033[2J")
								print(vrag)
								print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
								print(ship,"\n")
								sleep(0.2)
								k=58
								if "🧭 Излучатели дипольных отражателей" in re:
									diapol=2
								while not(i-_sdwig in sship["Твёрд"]) and diapol>0:
									diapol+=1
									if i<=_sdwig:
										i+=1
										ship3[i]=ship3[i-1]
										ship3[i-1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
									if i>_sdwig:
										i-=1
										ship3[i]=ship3[i+1]
										ship3[i+1]=" "
										print("\033[H\033[2J")
										print(vrag)
										print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
										print(ship,"\n")
										sleep(0.2)
							ii=i-_sdwig
							if ii in sship["Броня"]:
								vdefe-=2-1
							elif ii in sship["Уязвимость"]:
								vdefe-=2+1
							elif ii in sship["Трещина"]:
								vdefe-=2*(2)
							else:
								vdefe-=2
							if vdefe<0:
								defe+=vdefe
								vdefe=0
								if defe<0 and enef["🥇"]==0:
									life+=defe
									defe=0


					#Выстрел врага
					uvrag=[" "]*55+["\n"]
					if var["Урон"]!=[0,0]:
						for j in range(0,len(var["Урон"]),2):
							попал=False
							if ef["↩"]>0:
								ef["↩"]-=1
								while ship1[vs["Пушка"][var["Урон"][j+1]]+sdwig]!=" ":
									sdwig+=1
									midl.insert(0,midl.pop(-2))
							if ef["↪"]>0:
								ef["↪"]-=1
								while ship1[vs["Пушка"][var["Урон"][j+1]]+sdwig]!=" ":
									sdwig-=1
									midl.insert(-2,midl.pop(0))
							vrag1=[" "]*55+["\n"]
							vrag2=[" "]*55+["\n"]
							vrag3=[" "]*55+["\n"]
							for i in range(len(vs["1"])):
								if i in vs["Броня"]:
									vrag3[sdwig+i]="\033[1m\033[34m{}\033[0m".format(vs["3"][i])
								elif i in vs["Уязвимость"]:
									vrag3[sdwig+i]="\033[1m\033[33m{}\033[0m".format(vs["3"][i])
								elif i in vs["Трещина"]:
									vrag3[sdwig+i]="\033[1m\033[31m{}\033[0m".format(vs["3"][i])
								else:
									vrag3[sdwig+i]=vs["3"][i]
								vrag2[sdwig+i]=vs["2"][i]
								vrag1[sdwig+i]=vs["1"][i]
							kord=vs["Пушка"][var["Урон"][j+1]]+sdwig
							uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
							if midl[kord]==" ":
								midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
								uship[kord]="\033[1m\033[31m{}\033[0m".format("|")

								if ship1[kord]==" ":
									ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
									ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
									ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
								else:
									ii=kord-_sdwig
									if ii in sship["Броня"]:
										vdefe-=var["Урон"][j]-1
									elif ii in sship["Уязвимость"]:
										vdefe-=var["Урон"][j]+1
									elif ii in sship["Трещина"]:
										vdefe-=2*(var["Урон"][j])
									else:
										vdefe-=var["Урон"][j]
									попал=True
									if vdefe<0:
										defe+=vdefe
										vdefe=0
										if defe<0 and ef["🥇"]==0:
											life+=defe
											defe=0

							else:
								if blue(midl[kord]):
									midl[kord]=recolor(midl[kord])
								else:
									if "⦻" in midl[kord]:
										vbron-=2
										if vbron<0:
											bron+=vbron
											vbron=0
											if bron<0 and enef["🥇"]==0:
												hp+=bron
												bron=0
									if "⊕" in midl[kord]:
										hp+=2
									if "☄" in midl[kord]: 											ef["💎"]+=1
									midl[kord]="💥"
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							uvrag[kord]=" "
							if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								midl[kord]=" "
							if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[kord]=" "
							if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship3[kord]=" "
								ship2[kord]=" "
								ship1[kord]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,bron,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

					if var["ЭфУрон"]!=[0,0,"",0]:
						for j in range(0,len(var["ЭфУрон"]),4):
							попал=False
							if ef["↩"]>0:
								ef["↩"]-=1
								while ship1[vs["Пушка"][var["ЭфУрон"][j+1]]+sdwig]!=" ":
									sdwig+=1
									midl.insert(0,midl.pop(-2))
							if ef["↪"]>0:
								ef["↪"]-=1
								while ship1[vs["Пушка"][var["ЭфУрон"][j+1]]+sdwig]!=" ":
									sdwig-=1
									midl.insert(-2,midl.pop(0))
							vrag1=[" "]*55+["\n"]
							vrag2=[" "]*55+["\n"]
							vrag3=[" "]*55+["\n"]
							for i in range(len(vs["1"])):
								if i in vs["Броня"]:
									vrag3[sdwig+i]="\033[1m\033[34m{}\033[0m".format(vs["3"][i])
								elif i in vs["Уязвимость"]:
									vrag3[sdwig+i]="\033[1m\033[33m{}\033[0m".format(vs["3"][i])
								elif i in vs["Трещина"]:
									vrag3[sdwig+i]="\033[1m\033[31m{}\033[0m".format(vs["3"][i])
								else:
									vrag3[sdwig+i]=vs["3"][i]
								vrag2[sdwig+i]=vs["2"][i]
								vrag1[sdwig+i]=vs["1"][i]
							kord=vs["Пушка"][var["ЭфУрон"][j+1]]+sdwig
							uvrag[kord]="\033[1m\033[31m{}\033[0m".format("|")
							if midl[kord]==" ":
								midl[kord]="\033[1m\033[31m{}\033[0m".format("|")
								uship[kord]="\033[1m\033[31m{}\033[0m".format("|")

								if ship1[kord]==" ":
									ship1[kord]="\033[1m\033[31m{}\033[0m".format("|")
									ship2[kord]="\033[1m\033[31m{}\033[0m".format("|")
									ship3[kord]="\033[1m\033[31m{}\033[0m".format("|")
								else:
									ii=kord-_sdwig
									if ii in sship["Броня"]:
										vdefe-=var["ЭфУрон"][j]-1
									elif ii in sship["Уязвимость"]:
										vdefe-=var["ЭфУрон"][j]+1
									elif ii in sship["Трещина"]:
										vdefe-=2*(var["ЭфУрон"][j])
									else:
										vdefe-=var["ЭфУрон"][j]
									попал=True
									ef[var["ЭфУрон"][2+j]]+=var["ЭфУрон"][3+j]
									if vdefe<0:
										defe+=vdefe
										vdefe=0
										if defe<0 and ef["🥇"]==0:
											life+=defe
											defe=0

							else:
								if blue(midl[kord]):
									midl[kord]=recolor(midl[kord])
								else:
									if "⦻" in midl[kord]:
										vbron-=2
										if vbron<0:
											bron+=vbron
											vbron=0
											if bron<0 and enef["🥇"]==0:
												hp+=bron
												bron=0
									if "⊕" in midl[kord]:
										hp+=2
									if "☄" in midl[kord]: 											ef["💎"]+=1
									midl[kord]="💥"
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							uvrag[kord]=" "
							if midl[kord]=="💥" or midl[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								midl[kord]=" "
							if uship[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								uship[kord]=" "
							if ship1[kord]=="\033[1m\033[31m{}\033[0m".format("|"):
								ship3[kord]=" "
								ship2[kord]=" "
								ship1[kord]=" "
							if попал and ef["⇫"]+ef["⊥"]>0:
								vs,ef,enef,midl,sdwig,hp,bron,vbron,vdefe,life,bron,var=vustrel(sship,vs,ef,enef,midl,ship1,ship2,ship3,uship,sdwig,_sdwig,hp,bron,vbron,vdefe,vrag,ship,ef["⇫"]+ef["⊥"],defe,life,var,mhp,mbron,re,pr)
								pr=False
								if "▩ Калибратор оглушения" in re:
									if kalib:
										ef["🕸"]+=1
										kalib=False
								if "⏺ Слинковка" in re:
									slink+=1

					if var["Выпуск"]!=[" ",0]:
						for i in range(0,len(var["Выпуск"]),2):
							uvrag=[" "]*55+["\n"]
							if enef["🚀"]>0:
								if var["Выпуск"][i]=="ᐁ":
									vup="∆"
								if var["Выпуск"][i]=="▼":
									vup="▲"
								if var["Выпуск"][i]=="⟰":
									vup="⟱"
								if var["Выпуск"][i]=="⸔":
									vup="⸕"
								if var["Выпуск"][i]=="⇘":
									vup="⇖"
								if var["Выпуск"][i]=="⬇":
									vup="⬆"
								if var["Выпуск"][i]=="⤈":
									vup="⤉"
							else:
								vup=var["Выпуск"][i]
							uvrag[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=vup
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							uvrag[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=" "
							if midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]==" ":
								midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=vup
							else:
								if blue(midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]):
									midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=recolor(midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig])
								else:
									midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]="💥"
							print("\033[H\033[2J")
							print(vrag)
							print("".join(vrag1)+"".join(vrag2)+"".join(vrag3)+"".join(uvrag)+"".join(midl)+"".join(uship)+"".join(ship1)+"".join(ship2)+"".join(ship3))
							print(ship,"\n")
							sleep(0.2)
							if midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=="💥":
								midl[vs["Отсек"][var["Выпуск"][i+1]]+sdwig]=" "


					enef["↩"]=enef["↪"]=enef["⇫"]=0
					if enef["🔥"]>3:
						enef["🔥"]=0
						if enef["🥇"]==0:
							hp-=1
					if enef["🥇"]>0:
						enef["🥇"]-=1
					if enef["♦"]>0:
						enef["♦"]-=1
					hp-=enef["🩸"]
					life-=ef["🩸"]
					ef["🕸"]=ef["⇫"]=ef["🥾"]=ef["🚘"]=ef["↩"]=ef["↪"]=0
					if ef["🛑"]>0:
						if ef["⌚"]==0:
							ef["🛑"]-=1
					if ef["🛡"]>0:
						if ef["⌚"]==0:
							ef["🛡"]-=1
					if ef["🚀"]>0:
						ef["🚀"]-=1
					if ef["🔥"]>=3:
						ef["🔥"]=0
						if ef["🥇"]==0:
							life-=1
					if ef["🥇"]>0:
						if ef["⌚"]==0:
							ef["🥇"]-=1
					if ef["♦"]>0:
						if ef["⌚"]==0:
							ef["♦"]-=1
					if ef["⌚"]>0:
						ef["⌚"]-=1
					if "🪫 Зарядное устройство" in re:
						zaradn+=1
					if "🪫 Зарядное устройство" in re:
						if zaradn%4==0:
							ef["♦"]+=1
					for ii in range(len(var["Усиление"])//2):
						if var["Усиление"][2*ii]!="":
							enef[var["Усиление"][2*ii]]+=var["Усиление"][2*ii+1]
					for ii in range(len(var["Дебаф"])//2):
						if var["Дебаф"][2*ii]!="":
							ef[var["Дебаф"][2*ii]]+=var["Дебаф"][2*ii+1]

					if var["Щит"]!=[0,0]:
						for i in range(0,len(var["Щит"]),2):
							bron+=var["Щит"][i]
					vbron=0
					if var["Вщит"]!=[0,0]:
						for i in range(0,len(var["Вщит"]),2):
							vbron+=var["Вщит"][i]


					if var["Разд"]!=[0,0]:
						for i in range(0,len(var["Разд"]),2):
							if nam=="Башня":
								vta.append(var["Разд"][i])
							else:
								sbros.append(var["Разд"][i])

					#Конечные просчёты
					for i in range(len(ha)):
						if "🧲" in ha[0].доп:
							ha.append(ha.pop(0))
							i=0
						else:
							sbros.append(ha.pop(0))

					break
				r-=1
				i-=1
				if not("▟" in do.доп or "♾" in do.доп or sgor):
					sbros.append(do)
				if "▟" in do.доп or sgor:
					burn.append(do)
				if "🌤" in do.имя:
					var=ee()
				if "!!!" in do.имя:
					if do.перс=="Диззи":
						if not("А" in do.имя):
							defe=0
						bron=0
						var=ee()
					ha.pop(-1)
					sbros.extend(ha)
					ha=[]
					break
		if hp<=0:
			print("\033[H\033[2J")
			if "🏥 Корпус из нановолокон" in re:
				life+=1
				if "🩹 Усилитель лечения" in re:
					life+=1
			return life,defe
		if life<=0:
			print("\033[H\033[2J")
			print("Ты здесь?")
			exit()

def _r_(i):
	return random.choice([[i+4],[i+5],[i+6],[i+4,i+5],[i+4,i+6],[i+5,i+6],[i+4,i+5,i+6]])

icov=["\033[1m\033[34m{}\033[0m".format("⌈⟵⌉"),"\033[1m\033[34m{}\033[0m".format("|☠|"),"\033[1m\033[34m{}\033[0m".format("⌊⟵⌋")]
icoe=["\033[1m\033[31m{}\033[0m".format("⌈⟵⌉"),"\033[1m\033[31m{}\033[0m".format("|☠|"),"\033[1m\033[31m{}\033[0m".format("⌊⟵⌋")]
icop=["\033[1m\033[32m{}\033[0m".format("⌈⟵⌉"),"\033[1m\033[32m{}\033[0m".format("|☭|"),"\033[1m\033[32m{}\033[0m".format("⌊⟵⌋")]
icon=["\033[1m\033[33m{}\033[0m".format("⌈⟵⌉"),"\033[1m\033[33m{}\033[0m".format("|?|"),"\033[1m\033[33m{}\033[0m".format("⌊⟵⌋")]
icoa=["\033[1m\033[33m{}\033[0m".format("⌈⟵⌉"),"\033[1m\033[33m{}\033[0m".format("|0|"),"\033[1m\033[33m{}\033[0m".format("⌊⟵⌋")]
icodv=["  /"," / ","/  "]
icodn=["\  "," \ ","  \\"]
icopr=["   ","———","   "]
icovub=["   ","   "," v "]

def m():
	maps=[[0,0,[],0]]*(35+2)
	for i in range(len(maps)):
		if i==0:
			qq=copy.deepcopy(_r_(i))
			for jj in range(len(qq)):
				qq[jj]-=3
			maps[i]=[4,0,qq,1]
		elif i==36:
			maps[i]=[2,18,[],2]
		elif i==35:
			maps[i]=[2,16,[36],3]
		else:
			tyu1=((i==1 or i==2 or i==3) and i in maps[0][2])
			if i!=4 and i!=29 and i!=34 and i!=33 and ((i in maps[i-6][2] and maps[i-6][3]!=0) or (i in maps[i-5][2] and maps[i-5][3]!=0) or (i in maps[i-4][2] and maps[i-4][3]!=0) or tyu1):
				qq=copy.deepcopy(_r_(i))
				while 4 in qq:
					qq.remove(4)
				while 29 in qq:
					qq.remove(29)
				while 33 in qq:
					qq.remove(33)
				while 34 in qq:
					qq.remove(34)
				if i==30 or i==31 or i==32:
					qq=[35]
				if i%5==0:
					if i+4 in qq:
						qq.remove(i+4)
				if i%5==4:
					if i+6 in qq:
						qq.remove(i+6)
				if i>1 and maps[i-1][3]!=0:
					if i+5 in maps[i-1][2] and i+4 in qq:
						qq.remove(i+4)
				if qq==[]:
					qq=[i+5]
				if i==24:
					qq=[28]
				if i==28:
					qq=[32]
				maps[i]=[2*(i%5),2*(1+i//5),qq,1]
	return maps

def nagr(team,i,leg=False):
	print("\033[H\033[2J")
	e=[]
	e2=[]
	e1=[]
	if team=="Сущность":
		e2.append(24)
		e1.append(cards(e2[0]))
		e2.append(25)
		e1.append(cards(e2[1]))
		e2.append(26)
		e1.append(cards(e2[2]))
		e2.append(-666)
		e1.append(card(имя="Пропуск"))
		aa=vv("Карточная награда!",e1,len(e1),"",True)
		return e2[e1.index(aa)]
	if "Диззи" in team:
		if leg:
			e.extend([19,20,21,22,23])
		else:
			e.extend([3,4,5,6,7,8,9,10,11]*18+[12,13,14,15,16,17,18]*10+[19,20,21,22,23])
	if "Риггс" in team:
		if leg:
			e.extend([40,41,42,43,44])
		else:
			e.extend([24,25,26,27,28,29,30,31,32]*18+[33,34,35,36,37,38,39]*10+[40,41,42,43,44])
	if "Пери" in team:
		if leg:
			e.extend([61,62,63,64,65])
		else:
			e.extend([45,46,47,48,49,50,51,52,53]*18+[54,55,56,57,58,59,60]*10+[61,62,63,64,65])
	if "Айзек" in team:
		if leg:
			e.extend([82,83,84,85,86])
		else:
			e.extend([66,67,68,69,70,71,72,73,74]*18+[75,76,77,78,79,80,81]*9+[82,83,84,85,86])
	if "Дрейк" in team:
		if leg:
			e.extend([103,104,105,106,107])
		else:
			e.extend([87,88,89,90,91,92,93,94,95]*18+[96,97,98,99,100,101,102]*9+[103,104,105,106,107])
	if "Маск" in team:
		if leg:
			e.extend([124,125,126,127,128])
		else:
			e.extend([108,109,110,111,112,113,114,115,116]*18+[117,118,119,120,121,122,123]*9+[124,125,126,127,128])
	if "Академия" in team:
		if leg:
			e.extend([145,146,147,148,149])
		else:
			e.extend([129,130,131,132,133,134,135,136,137]*18+[138,139,140,141,142,143,144]*9+[145,146,147,148,149])
	for _ in range(i):
		e2.append(random.choice(e))
		e1.append(cards(e2[_]))
	e2.append(-666)
	e1.append(card(имя="Пропуск"))
	aa=vv("Карточная награда!",e1,len(e1),"",True)
	return e2[e1.index(aa)]

def verf(corp,r,relics,coloda):
	d(["Клео","Приветики! Как дела у вас?","Киса","Да знаешь, всё так же.","Клео","Какой там цикл? 400 или около того?","Киса","517!","Клео","Ну ладно, к делу!"])
	print("\033[H\033[2J")
	qqq=["Удалить карту","Улучшить карту","Ремонт","Нет, спасибо"]
	if "📦 Люк для сброса балласта" in re:
		qqq.append("Удалить 2 карты")
	aa=vv("Чего желаете?",qqq,len(qqq),"")
	if aa=="Улучшить карту":
		cco=[]
		for i in range(len(coloda)):
			if coloda[i]<=162:
				cco.append(cards(coloda[i]))
		gar=vv("Какую карту вы хотите улучшить?",cco,len(cco),"")
		ak=vv(gar.имя+" "+gar.show({"🔶":0,"♦":0}),[cards(162+coloda[cco.index(gar)]),cards(162*2+coloda[cco.index(gar)])],2,"",True)
		if cards(162+coloda[cco.index(gar)]).имя==ak.имя:
			coloda.append(162+coloda[cco.index(gar)])
		else:
			coloda.append(162*2+coloda[cco.index(gar)])
		coloda.remove(coloda[cco.index(gar)])
	if aa=="Ремонт":
		corp+=3
		if "🩹 Усилитель лечения" in re:
			corp+=1
		input("Ремонт корабля завершён!")
	if aa=="Удалить карту":
		cco=[]
		for i in range(len(coloda)):
			cco.append(cards(coloda[i]))
		ak=vv("Выберете карту для удаления",cco,len(cco),"")
		coloda.remove(cco.index(ak))
	if aa=="Удалить 2 карты":
		cco=[]
		for i in range(len(coloda)):
			cco.append(cards(coloda[i]))
		ak=vv("Выберете карту для удаления",cco,len(cco),"")
		coloda.remove(cco.index(ak))
		cco=[]
		for i in range(len(coloda)):
			cco.append(cards(coloda[i]))
		ak=vv("Выберете карту для удаления",cco,len(cco),"")
		coloda.remove(cco.index(ak))
	d(["Клео","Ни пуха!"])
	return corp,coloda,r

def voprosik(corp,mcorp,defen,coloda,re,relics,korabl,team,floor,ivents):
	print("\033[H\033[2J")
	ivent=ivents.copy()
	if floor==1:
		ivent.remove(13)
		ivent.remove(14)
		ivent.remove(15)
		ivent.remove(16)
		ivent.remove(17)
		ivent.remove(18)
		ivent.remove(19)
		ivent.remove(20)
	if floor==2:
		ivent.remove(6)
		ivent.remove(7)
		ivent.remove(8)
		ivent.remove(9)
		ivent.remove(20)
	if floor==3:
		ivent.remove(6)
		ivent.remove(7)
		ivent.remove(8)
		ivent.remove(9)
		ivent.remove(10)
		ivent.remove(11)
		ivent.remove(12)
		ivent.remove(13)
		ivent.remove(14)
	if corp>=mcorp*0.7:
		ivent.remove(3)
		if 6 in ivent:
			ivent.remove(6)
	iv=random.choice(ivent)
	ivents.remove(iv)
	if iv==0:
		d(["Киса","Обнаружено минное поле впереди.","Киса","Ого, тут большое количество взорванных кораблей!"])
		aa=vv("Давайте посмотрим, что тут есть! Уж мы то точно не нарвёмся!",["-1 ОЗ, получите 1 артефакт","-3 ОЗ, получите 1 из 4 артефактов","Оно того не стоит, проехали"],3,"")
		if aa=="-1 ОЗ, получите 1 артефакт":
			corp-=1
			re,relics,newart=art(re,relics,1)
			if newart=="🔵 Обшивка корпуса":
				mcorp+=3
				corp+=3
			if newart=="🩶 Бронированный отсек":
				korabl["Броня"].append(korabl["Отсек"][0])
			if "🆙 Адаптивное покрытие" in re:
				mcorp+=1
				corp+=1
				if "🩹 Усилитель лечения" in re:
					corp+=1
			d(["Киса","Отлично! Поехали дальше."])
		elif aa=="-3 ОЗ, получите 1 из 4 артефактов":
			corp-=3
			re,relics,newart=art(re,relics,4)
			if newart=="🔵 Обшивка корпуса":
				mcorp+=3
				corp+=3
			if newart=="🩶 Бронированный отсек":
				korabl["Броня"].append(korabl["Отсек"][0])
			if "🆙 Адаптивное покрытие" in re:
				mcorp+=1
				corp+=1
				if "🩹 Усилитель лечения" in re:
					corp+=1
			d(["Киса","Всё, хватит!!! Поехали дальше"])
		else:
			d(["Киса","Блин, никакогг веселья..."])
	elif iv==1:
		d([random.choice(team),"Ох... Голова раскалывается...","∆6§π§~","Снова вы?","Киса","Существо из иного измерения! Здравствуй!","∆6§π§~","Что вы цените больше всего?"])
		coloda.append(nagr("Сущность",3))
		d(["∆6§π§~","Так обрети же.","Киса","Спасибо!"])
	elif iv==2:
		d(["Селена","Действует программа изменения корабля! Пожалуйста, позвольте нам растасовать ваши части!","Киса","Пожалуйста, не надо!","Селена","Будет весело!"])
		aa=vv("Будем переставлять?",["Перемешиваем! +2 макс ОЗ","Абсолютно нет."],2,"")
		if aa=="Абсолютно нет.":
			d(["Селена","Ну и пожалуйста..."])
		else:
			mcorp+=2
			corp+=2
			if korabl["Имя"]=="Артемида":
				korabl={"Имя":"Артемида","Кабина":[1],"Отсек":[3],"Пушка":[4],"Остальное":[2,0],"Твёрд":[0,1,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"◣⌒◢~∥","2":"◥###◤","3":" ◹—◸ ","Щит":4}
			d(["Селена","Вот, стало же лучше :3","Киса","В КАКОМ МЕСТЕ ЭТО ЛУЧШЕ!?"])
	elif iv==3:
		d(["Мусорщица","Эй! Ваш корабль выглядиь испорченным! Позвольте мне привести его в порядок его."])
		aa=vv("Я предлагаю два вида ремонта: обычный и ооочень острый!",["Эээ, обычный, пожалуйста.","Ооочень острый!"],2,"")
		if aa=="Эээ, обычный, пожалуйста.":
			corp+=int(mcorp//2)
		else:
			r.append("💔 Лом брони")
		d(["Мусорщица","Гоооотово!","Киса","Спасибо!"])
	elif iv==4:
		d(["Бабушка","Здравствуйте, дорогуши! Что привело вас в мой магазин сладостей и оружия массовой анигиляции?","Киса","Оружия!","Диззи","Печенек!","Киса","И того и другово?"])
		aa=vv("Осмотритесь!",["Одно угощение!","Можно воспользоваться вашим мусорным ведром?"],2,"")
		if aa=="Можно воспользоваться вашим мусорным ведром?":
			cco=[]
			for i in range(len(coloda)):
				cco.append(cards(coloda[i]))
			ak=vv("Выберете карту для удаления",cco,len(cco),"")
			coloda.remove(cco.index(ak))
			d(["Бабушка","Удачи вам!"])
		else:
			coloda.append(nagr(team,1,True))
			d(["Киса","Вкусненько :3"])
	elif iv==5:
		d([random.choice(team),"Ох... Голова раскалывается... Словно статический шум...","∆6§π§~","Снова вы?","Киса","Существо из иного измерения! Здравствуй!","∆6§π§~","Кому мне восстановить воспоминания?"])
		aa=vv("dkqlskfhsiqnqwiuro20wjqnwyx",team,len(team),"")
		coloda.append(nagr([aa],3))
		d([aa,"Я теперт знаю кунг фу!","∆6§π§~","Нет, не знаешь.","Киса","Энергетические показатели вернулись в норму"])
	elif iv==6:
		d(["Киса","Так... Я поймала сигнал из заброшенной верфи...","Киса","Но как только мы вышли из гиперпространства, то оно исчезло...",random.choice(team),"О, таинственный сигнал!"])
		aa=vv("Мы могли бы попробовать залатать корпус!",["Давайте попробуем!","Не, не рискнём."],2,"")
		if aa=="Не, не рискнём.":
			d(["Киса","Хороший выбор. Запуск сверхсветового ядра!"])
		else:
			ra=random.choice([1,2])
			if ra==1:
				corp+=int(corp*0.5)
				d(["Киса","Отлично, мы подлатались!",team[0],"Блин, никакого космического монстра?"])
			else:
				corp+=1
				d([team[0],"Чёрт, засада!!!"])
				corp,defen=battle(korabl,corp,mcorp,coloda,5,"Беспилотник Цикада",mdefen,defen,re)
				coloda.append(nagr(team,3))
	elif iv==7:
		d(["Бримфорд","Приветствую. Хотите подработать контрабандистом?","Киса","Ну, смотря что делать","Бримфорд","Да мне тут артефакт надо сбагрить..."])
		vv("Ну...?",["Давай!","Нет"],2,"")
		if a=="Нет":
			d(["Бримфорд","Ну ладно, у меня тогда останется"])
		else:
			ra=random.choice([1,2])
			re,relics,newart=art(re,relics,3)
			if newart=="🔵 Обшивка корпуса":
				mcorp+=3
				corp+=3
			if newart=="🩶 Бронированный отсек":
				korabl["Броня"].append(korabl["Отсек"][0])
			d(["Бримфорд","Ну вот!","Киса","Лааадно..."])
			if ra==1:
				d(["Бримфорд","Ну, я пойду.","Киса","Лаааадно..."])
			else:
				d(["X.08","ОБНАРУЖЕНА КОНТРАБАНДА. АКТИВИРУЮ ОРУЖИЕ.","Киса","Так и знала..."])
				corp,defen=battle(korabl,corp,mcorp,coloda,5,"Истребитель Олень",mdefen,defen,re)
	elif iv==8:
		d(["Киса","Улавливаю сигнал бедствия? А нет, это как всегда пираты...","Дрейк","Хей, отдайте мне артефакт, или ещё что!","Киса","Ммм... Нет.","Дрейк","Тогда горите в аду!"])
		corp,defen=battle(korabl,corp,mcorp,coloda,5,"Болид Огненный шар",mdefen,defen,re)
	elif iv==9:
		d(["Маэстро","Ведутся строительные работы по улучшению карточек!"])
	elif iv==10:
		d(["Селена","Хей! У меня тут завалялись лишние строительные леса! Могу вментировать их посередине вашего корабля!","Селена","К тому же это отличный способ списания налогов)"])
		aa=vv("Что думаете",["Давай!","Не надо..."],2,"")
		if aa=="Не надо...":
			d(["Селена","Скукота..."])
		else:
			d(["Селена","Ура!"])
			if korabl["Имя"]=="Артемида":
				korabl={"Имя":"Артемида","Кабина":[4],"Отсек":[1],"Пушка":[2],"Остальное":[0,5],"Твёрд":[0,1,2,4,5],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"◢~∥ ⌒◣","2":"◥##=#◤","3":" ◹— ◸ ","Щит":4}
	elif iv==11:
		d(["Тяпляп","Ква.","Влад","Извините, но Крутецкий корабль Тяпляпа временно вне зоны действия сети."])
	elif iv==12:
		d(["Крапивщик","Знайте ли вы, что мы проводим программу апскейлинга?","Крапивщик","Мы удалим первую карту в вашей колоде и дадим новую на выбор!"])
		coloda.pop(0)
		coloda.append(nagr(team,3))
	return corp,mcorp,coloda,re,relics,korabl,ivents

def art(rer,relic,iii):
	print("\033[H\033[2J")
	relics=relic.copy()
	if "🚚 Грузовой трюм" in rer:
		iii+=1
	r1=[]
	for i in range(iii):
		r1.append(relics.pop(random.randint(0,len(relics)-1)))
	r1.append("Пропустить награду")
	aa=vv("Выберете реликвию!",r1,len(r1),"")
	if aa!="Пропустить награду":
		rer.append(aa)
		relic.remove(aa)
	return rer,relic,aa

glob=vv("""
	   _____     __        ____                    
	  / ___/__  / /  ___ _/ / /_  _______  _______ 
	 / /__/ _ \/ _ \/ _ `/ / __/ / __/ _ \/ __/ -_)
	 \___/\___/_.__/\_,_/_/\__/  \__/\___/_/  \__/ 
											  
""",["Новая игра","Продолжить игру"],2,"")

if glob=="Новая игра":
	vrags1=["Беспилотник Цикада","Разведдрон Комар","Хаб дронов Монарх","Сапёр","Перехватчик Куколка","Истребитель Олень","Башня","Дрон Жало"]
	elits1=["Болид Огненный шар","Сама скромность","Нидлер"]

	korabl={"Имя":"Артемида","Кабина":[3],"Отсек":[1],"Пушка":[2],"Остальное":[0,4],"Твёрд":[0,1,2,3,4],"Броня":[],"Уязвимость":[],"Трещина":[],"1":"◢~∥⌒◣","2":"◥###◤","3":" ◹—◸ ","Корпус":12,"Щит":4}
	coloda=[0,0,1,2]
	mcorp=corp=korabl["Корпус"]
	mdefen=korabl["Щит"]
	defen=0
	team=[]
	teams=["Диззи","Риггс","Пери","Айзек","Дрейк","Макс","Академия"]
	aa=vv("Выберете себе члена команды 1!",teams,len(teams),"")
	team.append(aa)
	teams.remove(aa)
	aa=vv("Выберете себе члена команды 2!",teams,len(teams),"")
	team.append(aa)
	teams.remove(aa)
	aa=vv("Выберете себе члена команды 3!",teams,len(teams),"")
	team.append(aa)
	teams.remove(aa)
	if "Диззи" in team:
		coloda.extend([4,9])
	if "Риггс" in team:
		coloda.extend([25,31])
	if "Пери" in team:
		coloda.extend([48,50])
	if "Айзек" in team:
		coloda.extend([66,69])
	if "Дрейк" in team:
		coloda.extend([89,93])
	if "Макс" in team:
		coloda.extend([108,112])
	if "Академия" in team:
		coloda.extend([130,136])
	ivents=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

	relics=["🏥 Корпус из нановолокон","🪫 Зарядное устройство","⏺ Слинковка","🧠 Щиты с памятью","🔌 Соединительный контур","🔵 Обшивка корпуса","🩶 Бронированный отсек","💢 Рекалибратор","🔗 Цепляющийся лазер","⛖ Реакционный двигатель","🔋 Аккумулятор Плюшкина","⚡ Кешбек","🏭 Разогнанный генератор","🐒 Обезьянья кабина","▩ Калибратор оглушения","🤯 Обнаружение трещин","🏓 Ракетка","🆙 Адаптивное покрытие","💣 Бронебойник","🩹 Усилитель лечения","📦 Люк для сброса балласта","🗂 Острые края","🧭 Излучатели дипольных отражателей"]

	re=["⛨ Предполётная подготовка","🚚 Грузовой трюм"]
	#d(["КОБАЛЬТ","ЗАВЕРШЕНИЕ ШИФРОВНИЯ ЛИЧНОСТНОГО ЯДРА.","КОБАЛЬТ","ЗАПУСК ЛИЧНОСТНОГО ЯДРА //cat.exe","КОБАЛЬТ","ОШИБКА!!! ЛИЧНОСТНОЕ ЯДРО ПОВРЕЖДЕНО!!!","КОБАЛЬТ","ПЕРЕЗАПУСК ЛИЧНОСТНОГО ЯДРА","КОБАЛЬТ","ОБНОВЛЁН ФАЙЛ 0Fx_...","КОБАЛЬТ","ЗАПУСК...","Киса","Ау?","Киса","...","Киса","Эй, проснитесь!","Пери","Ух... Голова раскалывается...","Киса","Так, хорошо, жизненные показатели в норме.","Диззи","Что происходит?","Киса","Мне пришлось вывести вас из криосна досрочно. Полностью восстановить память времени не хватило.","Риггс","Память? Но она же мне нужна!","Риггс","Наверное!","Киса","Простите! У меня не было выбора. Наш терминал откликается только на команды мясных форм жизни.","Киса","А у нас со стороны носа вражеский корабль оружие заряжает...","Пери","Все на мостик. Бегом!"])
	etaj=1

else:
	with open('CC_mini_save.pickle','rb') as f:
		korabl,team,corp,mcorp,defen,skreen,maps,re,relics,ivents,vrags1,elits1,i,coloda,etaj=pickle.load(f)
		mdefen=korabl["Щит"]

while etaj<=3:
	if glob=="Новая игра":
		vrags1=["Беспилотник Цикада","Разведдрон Комар","Хаб дронов Монарх","Сапёр","Перехватчик Куколка","Истребитель Олень","Башня","Дрон Жало"]
		elits1=["Болид Огненный шар","Сама скромность","Нидлер"]
		maps=copy.deepcopy(m())
		prom=[]
		for i in range(1,len(maps)-2):
			if maps[i][3]!=0:
				if maps[i][1]==10:
					maps[i][3]=5
				else:
					prom.append(1)

		while not(len(prom)<20 and len(prom)>15):
			maps=copy.deepcopy(m())
			prom=[]
			for i in range(1,len(maps)-2):
				if maps[i][3]!=0:
					if maps[i][1]==10:
						maps[i][3]=5
					else:
						prom.append(1)


		while not(prom.count(1) in range(8,10)):
			if prom.count(2)!=3:
				aa=[0]*len(prom)
				for i in range(len(prom)):
					aa[i]=i
				prom[aa.pop(random.randint(0,len(aa)-1))]=2
				prom[aa.pop(random.randint(0,len(aa)-1))]=2
				prom[aa.pop(random.randint(0,len(aa)-1))]=2
			else:
				prom[aa.pop(random.randint(0,len(aa)-1))]=random.choice([3,4,4])


		for i in range(1,len(maps)-2):
			if maps[i][3]!=0 and maps[i][3]!=5:
				maps[i][3]=prom.pop(0)

		skreen=(["   "]*19+["\n"])*27
		for i in range(len(maps)):
			if maps[i][3]==1:
				skreen[20*(maps[i][0])*3+maps[i][1]]=icov[0]
				skreen[20*(maps[i][0]*3+1)+maps[i][1]]=icov[1]
				skreen[20*(maps[i][0]*3+2)+maps[i][1]]=icov[2]
			if maps[i][3]==2:
				skreen[20*(maps[i][0])*3+maps[i][1]]=icoe[0]
				skreen[20*(maps[i][0]*3+1)+maps[i][1]]=icoe[1]
				skreen[20*(maps[i][0]*3+2)+maps[i][1]]=icoe[2]
			if maps[i][3]==3:
				skreen[20*(maps[i][0])*3+maps[i][1]]=icop[0]
				skreen[20*(maps[i][0]*3+1)+maps[i][1]]=icop[1]
				skreen[20*(maps[i][0]*3+2)+maps[i][1]]=icop[2]
			if maps[i][3]==4:
				skreen[20*(maps[i][0])*3+maps[i][1]]=icon[0]
				skreen[20*(maps[i][0]*3+1)+maps[i][1]]=icon[1]
				skreen[20*(maps[i][0]*3+2)+maps[i][1]]=icon[2]
			if maps[i][3]==5:
				skreen[20*(maps[i][0])*3+maps[i][1]]=icoa[0]
				skreen[20*(maps[i][0]*3+1)+maps[i][1]]=icoa[1]
				skreen[20*(maps[i][0]*3+2)+maps[i][1]]=icoa[2]

			for j in range(len(maps[i][2])):
				if maps[maps[i][2][j]][0]==maps[i][0]:
					skreen[20*((maps[i][0])*3+1)+maps[i][1]+1]=icopr[1]
				if maps[maps[i][2][j]][0]==maps[i][0]-2 and skreen[20*((maps[i][0])*3+1-3)+maps[i][1]+1]=="   ":
					skreen[20*((maps[i][0])*3-3)+maps[i][1]+1]=icodv[0]
					skreen[20*((maps[i][0])*3+1-3)+maps[i][1]+1]=icodv[1]
					skreen[20*((maps[i][0])*3+2-3)+maps[i][1]+1]=icodv[2]
				if maps[maps[i][2][j]][0]==maps[i][0]+2:
					skreen[20*((maps[i][0])*3+3)+maps[i][1]+1]=icodn[0]
					skreen[20*((maps[i][0])*3+1+3)+maps[i][1]+1]=icodn[1]
					skreen[20*((maps[i][0])*3+2+3)+maps[i][1]+1]=icodn[2]
		i=0
		a=vrags1.pop(0)
		corp,defen=battle(korabl,corp,mcorp,coloda,5,a,mdefen,defen,re)
		coloda.append(nagr(team,3))
		i=0

	end=k=True
	while end:
		if k:
			with open('CC_mini_save.pickle','wb') as f:
				pickle.dump([korabl,team,corp,mcorp,defen,skreen,maps,re,relics,ivents,vrags1,elits1,i,coloda,etaj],f)

		while -666 in coloda:
			coloda.remove(-666)
		if corp>mcorp:
			corp=mcorp
		print("\033[H\033[2J")
		s=["   "]*20+skreen.copy()
		if i==35:
			s[136]=icovub[2]
		elif i==36:
			s[138]=icovub[2]
			input()
			break
		elif i<35:
			s[20*(maps[i][0]*3-1)+maps[i][1]+20]=icovub[2]
		print("".join(s))
		print("\n".join(re))
		a=input()
		if k==False:
			if maps[i][3]==1:
				k=True
				a=vrags1.pop(random.randint(0,len(vrags1)-1))
				corp,defen=battle(korabl,corp,mcorp,coloda,5,a,mdefen,defen,re)
				coloda.append(nagr(team,3))
			if maps[i][3]==2:
				k=True
				a=elits1.pop(random.randint(0,len(elits1)-1))
				corp,defen=battle(korabl,corp,mcorp,coloda,5,a,mdefen,defen,re)
				coloda.append(nagr(team,3))
				r,relics,newart=art(re,relics,3)
				if newart=="🔵 Обшивка корпуса":
					mcorp+=3
					corp+=3
				if newart=="🩶 Бронированный отсек":
					korabl["Броня"].append(korabl["Отсек"][0])
				if "🆙 Адаптивное покрытие" in re:
					mcorp+=1
					corp+=1
					if "🩹 Усилитель лечения" in re:
						corp+=1
			if maps[i][3]==3:
				k=True
				corp,coloda,r=verf(corp,re,relics,coloda)
			if maps[i][3]==4:
				k=True
				corp,mcorp,coloda,re,relics,korabl,ivents=voprosik(corp,mcorp,defen,coloda,re,relics,korabl,team,etaj,ivents)
			if maps[i][3]==5:
				k=True
				re,relics,newart=art(re,relics,2)
				if newart=="🔵 Обшивка корпуса":
					mcorp+=3
					corp+=3
				if newart=="🩶 Бронированный отсек":
					korabl["Броня"].append(korabl["Отсек"])
		elif k==True:
			if a=="w" and i==0 and i+1 in maps[i][2]:
				i+=1
				k=False
			elif a=="d" and i==0 and i+2 in maps[i][2]:
				i+=2
				k=False
			elif a=="s" and i==0 and i+3 in maps[i][2]:
				i+=3
				k=False
			elif a=="d" and i==35:
				i=36
				k=False
			elif a=="w" and i!=31 and i!=32 and i!=33 and i+4 in maps[i][2]:
				i+=4
				k=False
			elif a=="d" and i+5 in maps[i][2] and i!=31 and i!=32 and i!=33:
				i+=5
				k=False
			elif a=="s" and i+6 in maps[i][2] and i!=31 and i!=32 and i!=33:
				i+=6
				k=False
			elif (a=="d" or a=="w" or a=="s") and (i==31 or i==32 or i==33):
				i=35
				k=False
	d(["Диззи","Что-то странное на радаре...","Риггс","Там что-то интересное?","Диззи","Большой кристал.","Пери","Что?","Диззи","Большой кристал."])
	corp,defen=battle(korabl,corp,mcorp,coloda,5,"Кристальное создание",mdefen,defen,re)
	input("Да будет свет!")
	glob="Новая игра"